learning/perl.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css" />
#+OPTIONS: \n:t
#+OPTIONS: ^:nil
* regex
** 零散知识
   windows 下换行符为 \r\n
   chomp和\Z不能解决
   + 在字符组内部
     *永远不是元字符
     -通常是元字符(只有在开头的时候不是)
     \b在字符组内外的意义不一样
   POSIX规定   .不能匹配NUL(值为0的字符),大多数的脚本语言容许文本中的出现NUL(而且可以用.匹配)
   可以用 \C 匹配单个字节  但最好不用

   + 字符组的运算
     .NET提供字符组的“减法”运算  [a-z]-[aeiou]
     Java regex pachage 可以使用 &&  [a-z]&&[^aeiou]  [ [abc][xyz] ] [abc[xyz]] 等

   \Q\E  取消之间元字符的特殊含义

   + 多选结构(|)
     优先级很低  eg. this and | or that 等价于 (this and)|(or that)
     (this|that|)   空表达式在任何情况下都能匹配  相当于  (this|that)?
** 元字符 字符组简记
   \R 匹配断行(\n \r\n)
   \v 垂直空白符
   \h 水平空白符
   \d 等价于[0-9],如果工具软件支持Unicode，能匹配所有的Unicode数字
   \D [^\d]
   \w [a-zA-Z0-9_] 某些工具软件不能匹配_ 而另一些则能支持当前locale中的所有数字和字符。
   如果支持Unicode 通常能表示所有数字和字符
   在java.util.regex和PCRE(也包括PHP)中 严格等价于[a-zA-Z0-9_]
   \s [ \f\n\r\t\v] 在支持Unicode的系统中，有时包含Unicode的换行控制字符U+0085，
   有时包含"空白"属性\p{Z}
   \S [^\s]
** 字符缩略表示法
   | \a | 警报　     | 通常对应ASCII中的<BEL>字符，八进制编码007                              |
   | \b | 退格　     | 通常对应ASCII中的<BS>字符，八进制编码010.                              |
   |    |            | (在许多流派中，\b只有在字符组内部才表示这样的意义，否则代表单词分界符) |
   | \e | Escape字符 | 　对应ASCII中的<ESC>字符，八进制编码033                                |
   | \f | 进纸符　   | 对应ASCII中的<FF>字符，八进制编码014                                   |
   | \n | 换行符　   | Unix DOS/Windows上对应ASCII的<LF>，八进制编码012.                      |
   |    |            | MacOS中对应ASCII的<CR>字符，十进制编码015.                             |
   |    |            | 在Java或任意一种.NET语言中，不论采用什么平台，都对应ASCII<LF>字符      |
   | \r | 回车　     | 对应ASCII的<CR>字符。在MacOS中对应ASCII的<LF>字符。                    |
   |    |            | 在Java或任意一种.NET语言中，不论采用什么平台，都对应ASCII<CR>字符      |
   | \t | 水平制表符 | 对应ASCII的<HT>字符，八进制编码011                                     |
   | \v | 垂直制表符 | 对应ASCII的<VT>字符，八进制编码013                                     |
   
** 转义及控制字符
   八进制转义  \num         \015\012  表示ASCII的CR/LF 序列
   十六进制转义 \xnum \x{num} \unum \Unum
   \nbsp\nbsp perl只支持\x
   \nbsp\nbsp java支持 \xFF \uFFFF
   控制字符    \cchar      \cH 匹配ASCII中的退格符， \cJ 匹配ASCII中的换行符
   GNU Emacs的元序列为 ?^char  如  ?^H
   
** 量词
   匹配优先量词 * + ? {num, num}  尽可能多的匹配
   忽略优先量词 *?  /+?  ??  {num, num}?  尽可能少的匹配
   占有优先量词 *+  ++  ?+  {num, num}+  一旦匹配不允许回溯 类似固化分组 (java.util.regex  PCRE)

** 锚点
   \A 匹配字符串的绝对开头
   \z 匹配字符串的绝对结尾
   \Z 匹配字符串的结尾可以怱略换行符
   一般与^$相似
   在/m 模式下^$匹配行首行尾
   \G 上一次匹配的结束位置  一般在 /c 模式下使用
** 模式
+ /m 多行模式　　　　　　　 ^$可以字符串内部的位置　\A \Z 相当于普通的　^ $
+ /x 宽松排列和注释模式　　可以在表达式中加入空白符
+ /s 单行模式(跨行匹配)　　此模式下 .可以匹配\n
+ /i 不区分大小写
+ /e 修饰词把REPLACEMENT当作一个perl代码块，而不仅仅是一个替换的字串。
  执行这段代码后得出的结果当作替换字串使用。
  可以多次使用/e 多次求值
+ /g 全局模式
  | 匹配类型 | 尝试开始位置            | 匹配成功时的pos值    | 匹配失败是的pos设定 |
  | m/.../   | 字符串起始位置(忽略pos) | 重置为undef          | 重置为undef         |
  | m/.../g  | 字符串的pos位置         | 匹配结束位置的偏移值 | 重置为undef         |
  | m/.../gc | 字符串的pos位置         | 匹配结束位置的偏移值 | 不变                |
+ /o 只编译一次 针对模式中的变量代换
+ 字符解释方式 ASCII(/a) Unicode(/u) locale(/l)
+ /aa 只采用ASCII方式的大小写映射处理 (unicode编码大小写比较乱)
+ /gc 匹配失败不会重置目标字符串的pos 一般与\G一起使用  /c 离不开/g
  #+BEGIN_SRC perl
  while(not  $html =~ m/\G\z/gc){
      if    ($html =~ m/\G( <[^>]+>   )/xgc) {print "TAG: $1\n"           }
      elsif ($html =~ m/\G( &\w+;     )/xgc) {print "NAMED ENTITY: $1\n"  }
      elsif ($html =~ m/\G( &\#\d+;   )/xgc) {print "NUMERIC ENTITY: $1\n"}
      elsif ($html =~ m/\G( [^<>&\n]+ )/xgc) {print "TEXT: $1\n"          }
      elsif ($html =~ m/\G  \n         /xgc) {print "NEWLINE\n"           }
      elsif ($html =~ m/\G( .         )/xgc) {print "ILLEGAL CHAR: $1\n"  }
      else {
          die "$0: oops, this shouldn't happen!";
      }
  }

  #+END_SRC
+ 模式修饰符
  (?i)(?-i) 在中间启用模式   <B>(?i)very(?-i)</B>
  大多数的实现方式中作用范围只限于括号内部  python不支持
  <B>(?:(?i)very)</B>  <B>(?i:very)</B>
  类似有 x   s   m  模式
** 条件判断 (?if then else)
** 分组 捕获 环视
*** 捕获型括号
    $str =~ m/some(regex)things/ # 标量环境下返回是否匹配  列表环境下返回捕获到的内容

*** 非捕获型括号
    只分组不捕获       (?:
