learning/perl.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>perl</title>
<!-- 2016-03-02 Wed 15:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="root" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<h1 class="title">perl</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. regex</a>
<ul>
<li><a href="#sec-1-1">1.1. 零散知识</a></li>
<li><a href="#sec-1-2">1.2. 元字符 字符组简记</a></li>
<li><a href="#sec-1-3">1.3. 字符缩略表示法</a></li>
<li><a href="#sec-1-4">1.4. 转义及控制字符</a></li>
<li><a href="#sec-1-5">1.5. 量词</a></li>
<li><a href="#sec-1-6">1.6. 锚点</a></li>
<li><a href="#sec-1-7">1.7. 模式</a></li>
<li><a href="#sec-1-8">1.8. 条件判断 (?if then else)</a></li>
<li><a href="#sec-1-9">1.9. 分组 捕获 环视</a>
<ul>
<li><a href="#sec-1-9-1">1.9.1. 捕获型括号</a></li>
<li><a href="#sec-1-9-2">1.9.2. 非捕获型括号</a></li>
<li><a href="#sec-1-9-3">1.9.3. 环视</a></li>
<li><a href="#sec-1-9-4">1.9.4. 固化分组 (?&gt;&#x2026;)</a></li>
<li><a href="#sec-1-9-5">1.9.5. 在正则中内嵌代码</a></li>
</ul>
</li>
<li><a href="#sec-1-10">1.10. 引擎</a></li>
<li><a href="#sec-1-11">1.11. POSIX 字符组</a></li>
<li><a href="#sec-1-12">1.12. Unicode</a>
<ul>
<li><a href="#sec-1-12-1">1.12.1. Unicode 属性，字母表和区块</a></li>
<li><a href="#sec-1-12-2">1.12.2. Unicode 组合字符序列 \X</a></li>
</ul>
</li>
<li><a href="#sec-1-13">1.13. <span class="todo TODO">TODO</span> java regex(other language)</a>
<ul>
<li><a href="#sec-1-13-1">1.13.1. java regex 中的 \</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. 一些特殊 默认变量</a>
<ul>
<li><a href="#sec-2-1">2.1. 缺省变量</a></li>
<li><a href="#sec-2-2">2.2. 正则中的变量</a></li>
<li><a href="#sec-2-3">2.3. 输入输出的变量</a></li>
<li><a href="#sec-2-4">2.4. 错误变量</a></li>
<li><a href="#sec-2-5">2.5. 系统变量</a></li>
<li><a href="#sec-2-6">2.6. 其它</a></li>
</ul>
</li>
<li><a href="#sec-3">3. 操作符</a>
<ul>
<li><a href="#sec-3-1">3.1. <span class="done DONE">DONE</span> 结合性、优先级</a></li>
<li><a href="#sec-3-2">3.2. <span class="done DONE">DONE</span> ~~ 智能匹配</a></li>
<li><a href="#sec-3-3">3.3. 按位运算操作符</a></li>
<li><a href="#sec-3-4">3.4. 字符串操作符</a></li>
<li><a href="#sec-3-5">3.5. 逻辑操作符</a></li>
<li><a href="#sec-3-6">3.6. <span class="done DONE">DONE</span> 比较操作符</a></li>
</ul>
</li>
<li><a href="#sec-4">4. 变量</a>
<ul>
<li><a href="#sec-4-1">4.1. 基础知识</a>
<ul>
<li><a href="#sec-4-1-1">4.1.1. 数字</a></li>
</ul>
</li>
<li><a href="#sec-4-2">4.2. here 文档</a></li>
<li><a href="#sec-4-3">4.3. 双引号内的\转义</a></li>
</ul>
</li>
<li><a href="#sec-5">5. 列表与数组</a>
<ul>
<li><a href="#sec-5-1">5.1. 基础知识</a></li>
<li><a href="#sec-5-2">5.2. 函数</a></li>
</ul>
</li>
<li><a href="#sec-6">6. 哈希 散列</a>
<ul>
<li><a href="#sec-6-1">6.1. <span class="todo TODO">TODO</span> 基础知识</a></li>
<li><a href="#sec-6-2">6.2. <span class="todo TODO">TODO</span> 函数</a></li>
</ul>
</li>
<li><a href="#sec-7">7. <span class="todo TODO">TODO</span> 数据结构</a></li>
<li><a href="#sec-8">8. 引用</a></li>
<li><a href="#sec-9">9. <span class="todo TODO">TODO</span> 子程序</a></li>
<li><a href="#sec-10">10. string 操作</a>
<ul>
<li><a href="#sec-10-1">10.1. 基本操作</a></li>
<li><a href="#sec-10-2">10.2. 字符操作</a></li>
<li><a href="#sec-10-3">10.3. 大小写转换</a></li>
</ul>
</li>
<li><a href="#sec-11">11. 文件目录及IO</a>
<ul>
<li><a href="#sec-11-1">11.1. <span class="todo TODO">TODO</span> glob</a></li>
<li><a href="#sec-11-2">11.2. <span class="done DONE">DONE</span> 文件测试</a></li>
<li><a href="#sec-11-3">11.3. <span class="todo TODO">TODO</span> 文件操作</a></li>
<li><a href="#sec-11-4">11.4. stat lstat 获得文件的属性</a></li>
<li><a href="#sec-11-5">11.5. <span class="todo TODO">TODO</span> 目录</a></li>
<li><a href="#sec-11-6">11.6. 文件句柄</a></li>
</ul>
</li>
<li><a href="#sec-12">12. 一些函数</a>
<ul>
<li><a href="#sec-12-1">12.1. 日期函数</a></li>
<li><a href="#sec-12-2">12.2. 简单</a></li>
</ul>
</li>
<li><a href="#sec-13">13. 结构控制</a>
<ul>
<li><a href="#sec-13-1">13.1. bool值</a></li>
<li><a href="#sec-13-2">13.2. 控制结构</a></li>
</ul>
</li>
<li><a href="#sec-14">14. <span class="todo TODO">TODO</span> 进程管理</a></li>
<li><a href="#sec-15">15. perl books</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> regex</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 零散知识</h3>
<div class="outline-text-3" id="text-1-1">
<p>
windows 下换行符为 \r\n<br  />
chomp和\Z不能解决<br  />
</p>
<ul class="org-ul">
<li>在字符组内部<br  />
*永远不是元字符<br  />
-通常是元字符(只有在开头的时候不是)<br  />
\b在字符组内外的意义不一样<br  />
</li>
</ul>
<p>
POSIX规定   .不能匹配NUL(值为0的字符),大多数的脚本语言容许文本中的出现NUL(而且可以用.匹配)<br  />
可以用 \C 匹配单个字节  但最好不用<br  />
</p>

<ul class="org-ul">
<li>字符组的运算<br  />
.NET提供字符组的“减法”运算  [a-z]-[aeiou]<br  />
Java regex pachage 可以使用 &amp;&amp;  [a-z]&amp;&amp;[^aeiou]  [ [abc][xyz] ] [abc[xyz]] 等<br  />
</li>
</ul>

<p>
\Q\E  取消之间元字符的特殊含义<br  />
</p>

<ul class="org-ul">
<li>多选结构(|)<br  />
优先级很低  eg. this and | or that 等价于 (this and)|(or that)<br  />
(this|that|)   空表达式在任何情况下都能匹配  相当于  (this|that)?<br  />
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 元字符 字符组简记</h3>
<div class="outline-text-3" id="text-1-2">
<p>
\R 匹配断行(\n \r\n)<br  />
\v 垂直空白符<br  />
\h 水平空白符<br  />
\d 等价于[0-9],如果工具软件支持Unicode，能匹配所有的Unicode数字<br  />
\D [^\d]<br  />
\w [a-zA-Z0-9_] 某些工具软件不能匹配_ 而另一些则能支持当前locale中的所有数字和字符。<br  />
如果支持Unicode 通常能表示所有数字和字符<br  />
在java.util.regex和PCRE(也包括PHP)中 严格等价于[a-zA-Z0-9_]<br  />
\s [ \f\n\r\t\v] 在支持Unicode的系统中，有时包含Unicode的换行控制字符U+0085，<br  />
有时包含"空白"属性\p{Z}<br  />
&sect; [^\s]<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 字符缩略表示法</h3>
<div class="outline-text-3" id="text-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">\a</td>
<td class="left">警报　</td>
<td class="left">通常对应ASCII中的&lt;BEL&gt;字符，八进制编码007</td>
</tr>

<tr>
<td class="left">\b</td>
<td class="left">退格　</td>
<td class="left">通常对应ASCII中的&lt;BS&gt;字符，八进制编码010.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">(在许多流派中，\b只有在字符组内部才表示这样的意义，否则代表单词分界符)</td>
</tr>

<tr>
<td class="left">\e</td>
<td class="left">Escape字符</td>
<td class="left">　对应ASCII中的&lt;ESC&gt;字符，八进制编码033</td>
</tr>

<tr>
<td class="left">\f</td>
<td class="left">进纸符　</td>
<td class="left">对应ASCII中的&lt;FF&gt;字符，八进制编码014</td>
</tr>

<tr>
<td class="left">\n</td>
<td class="left">换行符　</td>
<td class="left">Unix DOS/Windows上对应ASCII的&lt;LF&gt;，八进制编码012.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">MacOS中对应ASCII的&lt;CR&gt;字符，十进制编码015.</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">在Java或任意一种.NET语言中，不论采用什么平台，都对应ASCII&lt;LF&gt;字符</td>
</tr>

<tr>
<td class="left">\r</td>
<td class="left">回车　</td>
<td class="left">对应ASCII的&lt;CR&gt;字符。在MacOS中对应ASCII的&lt;LF&gt;字符。</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">在Java或任意一种.NET语言中，不论采用什么平台，都对应ASCII&lt;CR&gt;字符</td>
</tr>

<tr>
<td class="left">\t</td>
<td class="left">水平制表符</td>
<td class="left">对应ASCII的&lt;HT&gt;字符，八进制编码011</td>
</tr>

<tr>
<td class="left">\v</td>
<td class="left">垂直制表符</td>
<td class="left">对应ASCII的&lt;VT&gt;字符，八进制编码013</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 转义及控制字符</h3>
<div class="outline-text-3" id="text-1-4">
<p>
八进制转义  \num         \015\012  表示ASCII的CR/LF 序列<br  />
十六进制转义 \xnum \x{num} \unum \Unum<br  />
&nbsp;&nbsp; perl只支持\x<br  />
&nbsp;&nbsp; java支持 \xFF \uFFFF<br  />
控制字符    \cchar      \cH 匹配ASCII中的退格符， \cJ 匹配ASCII中的换行符<br  />
GNU Emacs的元序列为 ?^char  如  ?^H<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> 量词</h3>
<div class="outline-text-3" id="text-1-5">
<p>
匹配优先量词 * + ? {num, num}  尽可能多的匹配<br  />
忽略优先量词 *?  /+?  ??  {num, num}?  尽可能少的匹配<br  />
占有优先量词 *+  <del>+  ?</del>  {num, num}+  一旦匹配不允许回溯 类似固化分组 (java.util.regex  PCRE)<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 锚点</h3>
<div class="outline-text-3" id="text-1-6">
<p>
\A 匹配字符串的绝对开头<br  />
\z 匹配字符串的绝对结尾<br  />
\Z 匹配字符串的结尾可以怱略换行符<br  />
一般与^$相似<br  />
在/m 模式下^$匹配行首行尾<br  />
\G 上一次匹配的结束位置  一般在 /c 模式下使用<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 模式</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>/m 多行模式　　　　　　　 ^$可以字符串内部的位置　\A \Z 相当于普通的　^ $<br  />
</li>
<li>/x 宽松排列和注释模式　　可以在表达式中加入空白符<br  />
</li>
<li>/s 单行模式(跨行匹配)　　此模式下 .可以匹配\n<br  />
</li>
<li>/i 不区分大小写<br  />
</li>
<li>/e 修饰词把REPLACEMENT当作一个perl代码块，而不仅仅是一个替换的字串。<br  />
执行这段代码后得出的结果当作替换字串使用。<br  />
可以多次使用/e 多次求值<br  />
</li>
<li>/g 全局模式<br  />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">匹配类型</td>
<td class="left">尝试开始位置</td>
<td class="left">匹配成功时的pos值</td>
<td class="left">匹配失败是的pos设定</td>
</tr>

<tr>
<td class="left">m/&#x2026;/</td>
<td class="left">字符串起始位置(忽略pos)</td>
<td class="left">重置为undef</td>
<td class="left">重置为undef</td>
</tr>

<tr>
<td class="left">m/&#x2026;/g</td>
<td class="left">字符串的pos位置</td>
<td class="left">匹配结束位置的偏移值</td>
<td class="left">重置为undef</td>
</tr>

<tr>
<td class="left">m/&#x2026;/gc</td>
<td class="left">字符串的pos位置</td>
<td class="left">匹配结束位置的偏移值</td>
<td class="left">不变</td>
</tr>
</tbody>
</table>
</li>
<li>/o 只编译一次 针对模式中的变量代换<br  />
</li>
<li>字符解释方式 ASCII(/a) Unicode(/u) locale(/l)<br  />
</li>
<li>/aa 只采用ASCII方式的大小写映射处理 (unicode编码大小写比较乱)<br  />
</li>
<li>/gc 匹配失败不会重置目标字符串的pos 一般与\G一起使用  /c 离不开/g<br  />
<div class="org-src-container">

<pre class="src src-perl">while(not  $html =~ m/\G\z/gc){
    if    ($html =~ m/\G( &lt;[^&gt;]+&gt;   )/xgc) {print "TAG: $1\n"           }
    elsif ($html =~ m/\G( &amp;\w+;     )/xgc) {print "NAMED ENTITY: $1\n"  }
    elsif ($html =~ m/\G( &amp;\#\d+;   )/xgc) {print "NUMERIC ENTITY: $1\n"}
    elsif ($html =~ m/\G( [^&lt;&gt;&amp;\n]+ )/xgc) {print "TEXT: $1\n"          }
    elsif ($html =~ m/\G  \n         /xgc) {print "NEWLINE\n"           }
    elsif ($html =~ m/\G( .         )/xgc) {print "ILLEGAL CHAR: $1\n"  }
    else {
        die "$0: oops, this shouldn't happen!";
    }
}
</pre>
</div>
</li>
<li>模式修饰符<br  />
(?i)(?-i) 在中间启用模式   &lt;B&gt;(?i)very(?-i)&lt;/B&gt;<br  />
大多数的实现方式中作用范围只限于括号内部  python不支持<br  />
&lt;B&gt;(?:(?i)very)&lt;/B&gt;  &lt;B&gt;(?i:very)&lt;/B&gt;<br  />
类似有 x   s   m  模式<br  />
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 条件判断 (?if then else)</h3>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> 分组 捕获 环视</h3>
<div class="outline-text-3" id="text-1-9">
</div><div id="outline-container-sec-1-9-1" class="outline-4">
<h4 id="sec-1-9-1"><span class="section-number-4">1.9.1</span> 捕获型括号</h4>
<div class="outline-text-4" id="text-1-9-1">
<p>
$str =~ m/some(regex)things/ # 标量环境下返回是否匹配  列表环境下返回捕获到的内容<br  />
</p>
</div>
</div>
