learning/perl.org
*** 环视
    肯定顺序环视       (?=
    否定顺序环视       (?!
    肯定逆序环视       (?<=
    否定逆序环视       (?<!
    
*** 固化分组 (?>...)
    当匹配运行到此结构之后，那么此结构体中的所有备用状态都会被放弃。
    括号内的子表达式中未尝试过的备用状态都不存在了，所以回溯不能选择其中的状态。
    
    perl 和 python 限制逆序环视只能匹配固定长度的文本
    (?<!books?)   (?<!^\w+)   错误
    
    python php .net 支持命名捕获  (?P<Area>\d\d\d)  (?<Area>\d\d\d)
    
*** 在正则中内嵌代码
+ 动态正则结构 (??{perl code})
  #+BEGIN_SRC perl
    ^(\d+)(??{"X x { $1 }"})$  # 匹配 '3XXX' '12XXXXXXXXXXXX' 不能匹配'3X' '7XXXX'
  #+END_SRC
  匹配嵌套()
  #+BEGIN_SRC perl
  my $levelN;
  $levelN = qr/ (?> [^()]+ | \( (??{ $levelN } )\) )*  /x;
  if( $text =~ m/\b ( \w+ \( $levelN \) ) /x)
    print "found function call: $1";
  #+END_SRC
+ 内嵌代码结构 (?{arbitrary perl code})
  不需要用到返回值 更为通用,适合调试正则
  #+BEGIN_SRC perl
  "abcdefgh" =~ m{
    (?{print "Starting match at [$`|$']\n"})
    (?:d|e|f|g)
  }x;
  #+END_SRC
  结果是：
  starting match at [|abcdefgh]
  starting match at [a|bcdefgh]
  starting match at [ab|cdefgh]
  starting match at [abc|defgh]
** 引擎
   NFA DFA
   + DFA
     最左最长原则 不支持许多功能 没有回溯 文本主导
     速度与正则表达式无关
   + NFA 表达式主导 回溯
     速度与表达式直接相关
     
** POSIX 字符组
   [:alnum:]  字母字符和数字字符
   [:alpha:]  字母
   [:blank:]  空格和制表符
   [:cntrl:]  控制字符
   [:digit:]  数字
   [:graph:]  非空字符(即空白字符 控制字符之外的字符)
   [:lower:]  小写字母
   [:print:]  类似[:graph:] 但是包含空白字符
   [:punct:]  标点符号
   [:space:]  所有的空白字符
   [:upper:]  大写字母
   [:xdigit:] 十六进制中容许出现的数字
** Unicode
*** Unicode 属性，字母表和区块
**** 属性
     \p{...} \P{...}
     基本的Unicode属性分类
     | 分类 | 等价表示及描述                                                      |
     |--------+----------------------------------------------------------------------------|
     | \p{L}  | \p{Letter}  字符                                                           |
     | \p{M}* | \p{Mark}    不能单独出现必须与其他基本字符一起出现(重音符号、包围框，等等) |
     | \p{Z}  | \p{Separator} 用于表示分隔，但本身不可见的字符(各种空白字符) |
     | \p{S}  | \p{Symbol} 各种图形符号(Dingdats)和字母符号                     |
     | \p{N}  | \p{Number} 任何数字字符                                              |
     | \p{P}  | \p{Punctutation} 标点字符                                                  |
     | \p{C}  | \p{Other}   匹配其他任何字符(很少用于正常字符)                             |
     基本的Unicode子属性
     | 属性   | 等价表示法及说明                                                                       |
     |--------+----------------------------------------------------------------------------------------|
     | \p{Ll} | \p{Lowercase_Letter} 小写字母                                                          |
     | \p{Lu} | \p{Uppercase_Letter} 大写字母                                                          |
     | \p{Lt} | \p{Titlecase_Letter} 出现在单词开头的字母                                              |
     | \p{L&} | \p{Ll} \p{Lu} \p{Lt} 并集的简写                                                        |
     | \p{Lm} | \p{Modifier_Letter} 少数形似字母的，有特殊用途的字符                                   |
     | \p{Lo} | \p{Other_Letter} 没有大小写形式，也不属于修饰符的字母，包括希伯来语 阿拉伯语..中的字母 |
     |--------+----------------------------------------------------------------------------------------|
     | \p{Mn} | \p{Non_Spacing_Mark} 用于修饰其它字符的字符如重音符 变音符 某些“元音记号”和语调标记  |
     | \p{Mc} | \p{Spacing_Combining_Mark} 会占据一定的宽度的修饰字符                                  |
     |        | (各种语言中的大多数“元音记号”孟加拉语，印度古哈拉地语。。。)                         |
     | \p{Me} | \p{Encolsing_Mark} 可以围住其他字符的标记如圆圈方框钻石型等                            |
     |--------+----------------------------------------------------------------------------------------|
     | \p{Zs} | \p{Space_Separator} 各种空白字符 如空格符不间断空格以及各种固定宽度的空白字符          |
     | \p{Zl} | \p{Line_Separator} LINE SEPARATOR 字符(U+2028)                                         |
     | \p{Zp} | \p{Paragraph_Separator} PARAGRAPH SEPARATOR 字符(U+2029)                               |
     |--------+----------------------------------------------------------------------------------------|
     | \p{Sm} | \p{Math_Symbol} 数学符号 + 除 表示分数的横线                                           |
     | \p{Sc} | \p{Currency_Symbol} 货币符号 $ ￥ €                                                    |
     | \p{Sk} | \p{Modifier_Symbol} 大多数版本中它表示组合字符，                                       |
     |        | 但是作为功能完整的字符，它们有自己的意义                                               |
     | \p{So} | \p{Other_Symbol} 各种印刷符号框图符号盲文符号以及非字母形式的中文字符等                |
     |--------+----------------------------------------------------------------------------------------|
     | \p{Nd} | \p{Decimal_Digit_Number} 各种字母表中从0-9的数字(不包括中日韩文)                       |
     | \p{Nl} | \p{Letter_Number} 几乎所有的罗马数字                                                   |
     | \p{No} | \p{Other_Number} 作为加密符号和记号的数字，非阿拉伯数字的数字表示字符                  |
     |        | (不包括中文 日文 韩文中的数字)                                                         |
     |--------+----------------------------------------------------------------------------------------|
     | \p{Pd} | \p{Dash_Punctuation} 各种格式的连字符和短划线                                          |
     | \p{Ps} | \p{Open_Punctuation} ( 上书名号 《 等                                                  |
     | \p{Pe} | \p{Close_Punctuantion} ) 下书名号 》 等                                                |
     | \p{Pi} | \p{Initial_Punctuation} « “ 〈 等                                                     |
     | \p{Pf} | \p{Final_Punctutaion} » ’ 〉等                                                        |
     | \p{Pc} | \p{Connector_Punctuation} 少数有特殊语法含义的标点，如_                                |
     | \p{Po} | \p{Other_Punctuation} 用于表示其他所有标点字符: !&. 等                                 |
     |--------+----------------------------------------------------------------------------------------|
     | \p{Cc} | \p{Control} ASCII和Latin-1编码中的控制字符(TAB LF CR 等)                               |
     | \p{Cf} | \p{Format} 用于表示格式的不可见字符                                                    |
     | \p{Co} | \p{Private_Use} 分配与私人用途的代码点(如公司的logo)                                   |
     | \p{Cn} | \p{Unassigned} 目前尚未分配字符的代码点                                                | 
     
**** 区块
     \p{InTibetan} 从U+0f00 到 U+0fff的256个代码点
     区块可能含未赋值的代码点
     并不是和区块相关的所有字符都在区块内部
     区块通常包含不相关的字符
     属于横个字母表的字符可能同时包含于多个区块
*** Unicode 组合字符序列 \X
    #+BEGIN_SRC perl
    $reg = qr/\X/;
    # 缩略表示 \P{M}\p{M}* 它可以视为 .的扩展。它匹配一个基本字符(除\p{M}之外的任何字符)，
    # 之后可能有任意数目的组合字符(除\p{M}之外)
    # \X 与 . 的差别
    # 能够匹配结尾的组合字符
    # \X始终能匹配换行符和其他Unicode行终结符
    # 点号无论什么情况下都能匹配任何字符，而\X 不能匹配以组合字符开头的字符
    #+END_SRC

** TODO java regex(other language)
