learning/perl.html

<div id="outline-container-sec-1-9-2" class="outline-4">
<h4 id="sec-1-9-2"><span class="section-number-4">1.9.2</span> 非捕获型括号</h4>
<div class="outline-text-4" id="text-1-9-2">
<p>
只分组不捕获       (?:<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-9-3" class="outline-4">
<h4 id="sec-1-9-3"><span class="section-number-4">1.9.3</span> 环视</h4>
<div class="outline-text-4" id="text-1-9-3">
<p>
肯定顺序环视       (?=<br  />
否定顺序环视       (?!<br  />
肯定逆序环视       (?&lt;=<br  />
否定逆序环视       (?&lt;!<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-9-4" class="outline-4">
<h4 id="sec-1-9-4"><span class="section-number-4">1.9.4</span> 固化分组 (?&gt;&#x2026;)</h4>
<div class="outline-text-4" id="text-1-9-4">
<p>
当匹配运行到此结构之后，那么此结构体中的所有备用状态都会被放弃。<br  />
括号内的子表达式中未尝试过的备用状态都不存在了，所以回溯不能选择其中的状态。<br  />
</p>

<p>
perl 和 python 限制逆序环视只能匹配固定长度的文本<br  />
(?&lt;!books?)   (?&lt;!^\w+)   错误<br  />
</p>

<p>
python php .net 支持命名捕获  (?P&lt;Area&gt;\d\d\d)  (?&lt;Area&gt;\d\d\d)<br  />
</p>
</div>
</div>

<div id="outline-container-sec-1-9-5" class="outline-4">
<h4 id="sec-1-9-5"><span class="section-number-4">1.9.5</span> 在正则中内嵌代码</h4>
<div class="outline-text-4" id="text-1-9-5">
<ul class="org-ul">
<li>动态正则结构 (??{perl code})<br  />
<div class="org-src-container">

<pre class="src src-perl">^(\d+)(??{"X x { $1 }"})$  # 匹配 '3XXX' '12XXXXXXXXXXXX' 不能匹配'3X' '7XXXX'
</pre>
</div>
<p>
匹配嵌套()<br  />
</p>
<div class="org-src-container">

<pre class="src src-perl">my $levelN;
$levelN = qr/ (?&gt; [^()]+ | \( (??{ $levelN } )\) )*  /x;
if( $text =~ m/\b ( \w+ \( $levelN \) ) /x)
  print "found function call: $1";
</pre>
</div>
</li>
<li>内嵌代码结构 (?{arbitrary perl code})<br  />
不需要用到返回值 更为通用,适合调试正则<br  />
<div class="org-src-container">

<pre class="src src-perl">"abcdefgh" =~ m{
  (?{print "Starting match at [$`|$']\n"})
  (?:d|e|f|g)
}x;
</pre>
</div>
<p>
结果是：<br  />
starting match at [|abcdefgh]<br  />
starting match at [a|bcdefgh]<br  />
starting match at [ab|cdefgh]<br  />
starting match at [abc|defgh]<br  />
</p>
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> 引擎</h3>
<div class="outline-text-3" id="text-1-10">
<p>
NFA DFA<br  />
</p>
<ul class="org-ul">
<li>DFA<br  />
最左最长原则 不支持许多功能 没有回溯 文本主导<br  />
速度与正则表达式无关<br  />
</li>
<li>NFA 表达式主导 回溯<br  />
速度与表达式直接相关<br  />
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-11" class="outline-3">
<h3 id="sec-1-11"><span class="section-number-3">1.11</span> POSIX 字符组</h3>
<div class="outline-text-3" id="text-1-11">
<p>
[:alnum:]  字母字符和数字字符<br  />
[:alpha:]  字母<br  />
[:blank:]  空格和制表符<br  />
[:cntrl:]  控制字符<br  />
[:digit:]  数字<br  />
[:graph:]  非空字符(即空白字符 控制字符之外的字符)<br  />
[:lower:]  小写字母<br  />
[:print:]  类似[:graph:] 但是包含空白字符<br  />
[:punct:]  标点符号<br  />
[:space:]  所有的空白字符<br  />
[:upper:]  大写字母<br  />
[:xdigit:] 十六进制中容许出现的数字<br  />
</p>
</div>
</div>
<div id="outline-container-sec-1-12" class="outline-3">
<h3 id="sec-1-12"><span class="section-number-3">1.12</span> Unicode</h3>
<div class="outline-text-3" id="text-1-12">
</div><div id="outline-container-sec-1-12-1" class="outline-4">
<h4 id="sec-1-12-1"><span class="section-number-4">1.12.1</span> Unicode 属性，字母表和区块</h4>
<div class="outline-text-4" id="text-1-12-1">
</div><ol class="org-ol"><li><a id="sec-1-12-1-1" name="sec-1-12-1-1"></a>属性<br  /><div class="outline-text-5" id="text-1-12-1-1">
<p>
\p{...} \P{...}<br  />
基本的Unicode属性分类<br  />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">分类</th>
<th scope="col" class="left">等价表示及描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">\p{L}</td>
<td class="left">\p{Letter}  字符</td>
</tr>

<tr>
<td class="left">\p{M}*</td>
<td class="left">\p{Mark}    不能单独出现必须与其他基本字符一起出现(重音符号、包围框，等等)</td>
</tr>

<tr>
<td class="left">\p{Z}</td>
<td class="left">\p{Separator} 用于表示分隔，但本身不可见的字符(各种空白字符)</td>
</tr>

<tr>
<td class="left">\p{S}</td>
<td class="left">\p{Symbol} 各种图形符号(Dingdats)和字母符号</td>
</tr>

<tr>
<td class="left">\p{N}</td>
<td class="left">\p{Number} 任何数字字符</td>
</tr>

<tr>
<td class="left">\p{P}</td>
<td class="left">\p{Punctutation} 标点字符</td>
</tr>

<tr>
<td class="left">\p{C}</td>
<td class="left">\p{Other}   匹配其他任何字符(很少用于正常字符)</td>
</tr>
</tbody>
</table>
<p>
基本的Unicode子属性<br  />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">属性</th>
<th scope="col" class="left">等价表示法及说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">\p{Ll}</td>
<td class="left">\p{Lowercase_Letter} 小写字母</td>
</tr>

<tr>
<td class="left">\p{Lu}</td>
<td class="left">\p{Uppercase_Letter} 大写字母</td>
</tr>

<tr>
<td class="left">\p{Lt}</td>
<td class="left">\p{Titlecase_Letter} 出现在单词开头的字母</td>
</tr>

<tr>
<td class="left">\p{L&}</td>
<td class="left">\p{Ll} \p{Lu} \p{Lt} 并集的简写</td>
</tr>

<tr>
<td class="left">\p{Lm}</td>
<td class="left">\p{Modifier_Letter} 少数形似字母的，有特殊用途的字符</td>
</tr>

<tr>
<td class="left">\p{Lo}</td>
<td class="left">\p{Other_Letter} 没有大小写形式，也不属于修饰符的字母，包括希伯来语 阿拉伯语..中的字母</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\p{Mn}</td>
<td class="left">\p{Non_Spacing_Mark} 用于修饰其它字符的字符如重音符 变音符 某些“元音记号”和语调标记</td>
</tr>

<tr>
<td class="left">\p{Mc}</td>
<td class="left">\p{Spacing_Combining_Mark} 会占据一定的宽度的修饰字符</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">(各种语言中的大多数“元音记号”孟加拉语，印度古哈拉地语。。。)</td>
</tr>

<tr>
<td class="left">\p{Me}</td>
<td class="left">\p{Encolsing_Mark} 可以围住其他字符的标记如圆圈方框钻石型等</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\p{Zs}</td>
<td class="left">\p{Space_Separator} 各种空白字符 如空格符不间断空格以及各种固定宽度的空白字符</td>
</tr>

<tr>
<td class="left">\p{Zl}</td>
<td class="left">\p{Line_Separator} LINE SEPARATOR 字符(U+2028)</td>
</tr>

<tr>
<td class="left">\p{Zp}</td>
<td class="left">\p{Paragraph_Separator} PARAGRAPH SEPARATOR 字符(U+2029)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\p{Sm}</td>
<td class="left">\p{Math_Symbol} 数学符号 + 除 表示分数的横线</td>
</tr>

<tr>
<td class="left">\p{Sc}</td>
<td class="left">\p{Currency_Symbol} 货币符号 $ ￥ €</td>
</tr>

<tr>
<td class="left">\p{Sk}</td>
<td class="left">\p{Modifier_Symbol} 大多数版本中它表示组合字符，</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">但是作为功能完整的字符，它们有自己的意义</td>
</tr>

<tr>
<td class="left">\p{So}</td>
<td class="left">\p{Other_Symbol} 各种印刷符号框图符号盲文符号以及非字母形式的中文字符等</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\p{Nd}</td>
<td class="left">\p{Decimal_Digit_Number} 各种字母表中从0-9的数字(不包括中日韩文)</td>
</tr>

<tr>
<td class="left">\p{Nl}</td>
<td class="left">\p{Letter_Number} 几乎所有的罗马数字</td>
</tr>

<tr>
<td class="left">\p{No}</td>
<td class="left">\p{Other_Number} 作为加密符号和记号的数字，非阿拉伯数字的数字表示字符</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">(不包括中文 日文 韩文中的数字)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\p{Pd}</td>
<td class="left">\p{Dash_Punctuation} 各种格式的连字符和短划线</td>
</tr>

<tr>
<td class="left">\p{Ps}</td>
<td class="left">\p{Open_Punctuation} ( 上书名号 《 等</td>
</tr>

<tr>
<td class="left">\p{Pe}</td>
<td class="left">\p{Close_Punctuantion} ) 下书名号 》 等</td>
</tr>

<tr>
<td class="left">\p{Pi}</td>
<td class="left">\p{Initial_Punctuation} « “ 〈 等</td>
</tr>

<tr>
<td class="left">\p{Pf}</td>
<td class="left">\p{Final_Punctutaion} » ’ 〉等</td>
</tr>

<tr>
<td class="left">\p{Pc}</td>
<td class="left">\p{Connector_Punctuation} 少数有特殊语法含义的标点，如_</td>
</tr>

<tr>
<td class="left">\p{Po}</td>
<td class="left">\p{Other_Punctuation} 用于表示其他所有标点字符: !&amp;. 等</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="left">\p{Cc}</td>
<td class="left">\p{Control} ASCII和Latin-1编码中的控制字符(TAB LF CR 等)</td>
</tr>

<tr>
<td class="left">\p{Cf}</td>
<td class="left">\p{Format} 用于表示格式的不可见字符</td>
</tr>

<tr>
<td class="left">\p{Co}</td>
<td class="left">\p{Private_Use} 分配与私人用途的代码点(如公司的logo)</td>
</tr>

<tr>
<td class="left">\p{Cn}</td>
<td class="left">\p{Unassigned} 目前尚未分配字符的代码点</td>
</tr>
</tbody>
</table>
</div>
</li>

<li><a id="sec-1-12-1-2" name="sec-1-12-1-2"></a>区块<br  /><div class="outline-text-5" id="text-1-12-1-2">
<p>
\p{InTibetan} 从U+0f00 到 U+0fff的256个代码点<br  />
区块可能含未赋值的代码点<br  />
并不是和区块相关的所有字符都在区块内部<br  />
区块通常包含不相关的字符<br  />
属于横个字母表的字符可能同时包含于多个区块<br  />
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-12-2" class="outline-4">
<h4 id="sec-1-12-2"><span class="section-number-4">1.12.2</span> Unicode 组合字符序列 \X</h4>
<div class="outline-text-4" id="text-1-12-2">
<div class="org-src-container">

<pre class="src src-perl">$reg = qr/\X/;
# 缩略表示 \P{M}\p{M}* 它可以视为 .的扩展。它匹配一个基本字符(除\p{M}之外的任何字符)，
# 之后可能有任意数目的组合字符(除\p{M}之外)
# \X 与 . 的差别
# 能够匹配结尾的组合字符
# \X始终能匹配换行符和其他Unicode行终结符
# 点号无论什么情况下都能匹配任何字符，而\X 不能匹配以组合字符开头的字符
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-1-13" class="outline-3">
<h3 id="sec-1-13"><span class="section-number-3">1.13</span> <span class="todo TODO">TODO</span> java regex(other language)</h3>
