learning/perl.org
*** java regex 中的 \
   java 中Pattern.compile(String str);
   str 并不是正则表达式，只是一个字符串，经过编译之后才是正真的表达式
   Pattern.compile("[\u2e80-\u9FFF]")
   经过编译 \u2e80 \u9FFF 会变为相应的字符，整个表达式变为类似 [a-z]这种形式
   Pattern.compile("[\\u2e80-\\u9FFF]")
   编译后 变为 [\u2e80-\u9fff] 这种形式
   两种形式都可以匹配成功

* 一些特殊 默认变量
** 缺省变量
   | 变量 | 英文名 | 说明     |
   |------+--------+----------|
   | $_   | $ARG   | 默认变量 |
   | @_   |        | 函数参数 |
** 正则中的变量
   $1 $2 .. 捕获变量
   | 变量 | 英文名              | 说明                                       |
   |------+---------------------+--------------------------------------------|
   | $&   | $MATCH              | 匹配的部分                                 |
   | $`   | $PREMATCH           | 匹配部分之前的内容                         |
   | $'   | $POSTMATCH          | 未匹配的部分                               |
   | $+   | $LAST_PAREN_MATCH   | 最后一个圆括号中匹配的部分                 |
   | $*   | $MULTILINE_MATCHING  | 多行匹配须将此值设成1                      |
   | @+   | @LAST_MATCH_END     | 保存当前匹配的最后成功子匹配的结尾的偏移量 |
   |      |                     | $+[0]是整个匹配的偏移量,$+[1]...           |
   | @-   | @LAST_MATCH_START   | 同上 开始偏移量                            |
   #+begin_src perl
 if("hello there, neighbor" =~ /\s(\w+),/){
     print $1;   # "there"
     print $&;   # "there,"
     print $`;   # "hello"
     print $';   # "neighbor"
 }
   #+end_src
** 输入输出的变量
   | 变量 | 英文名                        | 说明                                                        |
   |------+-------------------------------+-------------------------------------------------------------|
   | $.   | $INPUT_LINE_NUMBE             | 最近一次执行读操作的当前行数                                |
   | $/   | $INPUT_RECORD_SEPARATOR       | 输入记录分隔符,缺省是新行 chomp 取自变量"$/"                |
   | $,   | $OUTPUT_FIELD_SEPARATOR       | print 操作的输出域分隔符                                    |
   | $\   | $OUTPUT_RECORD_SEPARATOR      | print 操作的输出记录分隔符,通常用于省略换行符               |
   | $"   | $LIST_SEPARATOR               | 当数组转换成字符串时,元素缺省以空格分隔                     |
   | $^L  | $FORMAT_FORMFEED              | 当执行一个进纸动作时输出的字符.缺省是\f                     |
   | $:   | $FORMAT_LINE_BREAK_CHARACTERS    | 就是目前可以作为折行的字符集合.缺省值是\n(空白 换行 连字号) |
   | $^A  | $ACCUMULATOR                  | 格式化行的写收集器的当前值                                  |
** 错误变量
   | 变量 | 英文名             | 说明                                  |
   |------+--------------------+---------------------------------------|
   | $?   | $CHILD_ERROR       | 包含了最近一次执行的外部程序结束状态  |
   | $!   | $OS_ERROR,$ERRNO   | 包含了系统的错误.(错误码 或 错误信息) |
   | $\^E | $EXTENDED_OS_ERROR   | 在某些平台,返回扩展错误信息           |
   | $@   | $EVAL_ERROR        | 从上一个eval命令的Perl语法错误信息    |
   
** 系统变量
   | $ $   | $PROCESS_ID $PID          | 运行当前Perl进程的pid                           |
   | $<    | $REAL_USER_ID $UID        | 当前进程的实际用户标识符(uid)              |
   | $>    | $EFFECTIVE_USER_ID $EUID   | 当前进程的有效用户标识符                               |
   | $(    | $REAL_GROUP_ID $GID       | 当前进程的实际组标识符(gid)                            |
   | $)    | $EFFECTIVE_GROUP_ID $EGID   | 当前进程的有效组标识符                                 |
   | $0    | $REOGRAM_NAME             | 正在执行的Perl脚本的文件名称.                          |
   | $[    |                           | 数组中第一个元素的序号或字符串中第一个字符的序号.缺省是0 |
   | $]    | $PERL_VERSION             | 返回版本号,加上补丁级别除以1000                        |
   | $^D   | $DEBUGGING                | 调试标志的当前值                                       |
   | $^F   | $SYSTEM_FD_MAX            | 最大的系统文件描述符,通常是2                           |
   | $^I   | $INPLACE_EDIT             | 原地编辑扩展的当前值.可使用undef禁止原地编辑           |
   | $^M   |                           | $M的内容能用件紧急内存池,以便Perl                      |
   |       |                           | 出out-of-memory错误时使用.使用$M要求Perl进行特殊的编译 |
   | $^O   | $OSNAME                   | 编译Perl本身时的操作系统名称                           |
   | $^P   | $PERLDB                   | 是否打开调试                                           |
   | $^T   | $BASETIME                 | 当前脚本开始进行的时间,以秒为单位,从1970年开始         |
   | $^W   | $WARNING                  | 警告开关的当前值,真或假                                |
   | $^X   | $EXECUTABLE_NAME          | 二进制Perl执行文件的名称                               |
   | $ARGV |                           | 当从<>读入时的当前文件名                               |
   
** 其它
   | 变量  | 说明                                 |
   |-------+--------------------------------------|
   | @ARGV | 命令行参数                           |
   | $ARGV | 当前文件的文件名,代表标准输入<STDIN> |
   | @INC  | 寻找Perl脚本的地址表                 |
   | %INC  | 通过do或requir包含的文件名的目录     |
   
* 操作符
