learning/perl.html
<div class="outline-text-3" id="text-1-13">
</div><div id="outline-container-sec-1-13-1" class="outline-4">
<h4 id="sec-1-13-1"><span class="section-number-4">1.13.1</span> java regex 中的 \</h4>
<div class="outline-text-4" id="text-1-13-1">
<p>
java 中Pattern.compile(String str);<br  />
str 并不是正则表达式，只是一个字符串，经过编译之后才是正真的表达式<br  />
Pattern.compile("[\u2e80-\u9FFF]")<br  />
经过编译 \u2e80 \u9FFF 会变为相应的字符，整个表达式变为类似 [a-z]这种形式<br  />
Pattern.compile("[\\u2e80-\\u9FFF]")<br  />
编译后 变为 [\u2e80-\u9fff] 这种形式<br  />
两种形式都可以匹配成功<br  />
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 一些特殊 默认变量</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> 缺省变量</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">变量</th>
<th scope="col" class="left">英文名</th>
<th scope="col" class="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">$_</td>
<td class="left">$ARG</td>
<td class="left">默认变量</td>
</tr>

<tr>
<td class="left">@_</td>
<td class="left">&#xa0;</td>
<td class="left">函数参数</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> 正则中的变量</h3>
<div class="outline-text-3" id="text-2-2">
<p>
$1 $2 .. 捕获变量<br  />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">变量</th>
<th scope="col" class="left">英文名</th>
<th scope="col" class="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">$&amp;</td>
<td class="left">$MATCH</td>
<td class="left">匹配的部分</td>
</tr>

<tr>
<td class="left">$`</td>
<td class="left">$PREMATCH</td>
<td class="left">匹配部分之前的内容</td>
</tr>

<tr>
<td class="left">$'</td>
<td class="left">$POSTMATCH</td>
<td class="left">未匹配的部分</td>
</tr>

<tr>
<td class="left">$+</td>
<td class="left">$LAST_PAREN_MATCH</td>
<td class="left">最后一个圆括号中匹配的部分</td>
</tr>

<tr>
<td class="left">$*</td>
<td class="left">$MULTILINE_MATCHING</td>
<td class="left">多行匹配须将此值设成1</td>
</tr>

<tr>
<td class="left">@+</td>
<td class="left">@LAST_MATCH_END</td>
<td class="left">保存当前匹配的最后成功子匹配的结尾的偏移量</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">$+<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup>是整个匹配的偏移量,$+<sup><a id="fnr.2" name="fnr.2" class="footref" href="#fn.2">2</a></sup>&#x2026;</td>
</tr>

<tr>
<td class="left">@-</td>
<td class="left">@LAST_MATCH_START</td>
<td class="left">同上 开始偏移量</td>
</tr>
</tbody>
</table>
<div class="org-src-container">

<pre class="src src-perl">if("hello there, neighbor" =~ /\s(\w+),/){
    print $1;   # "there"
    print $&amp;;   # "there,"
    print $`;   # "hello"
    print $';   # "neighbor"
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> 输入输出的变量</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">变量</th>
<th scope="col" class="left">英文名</th>
<th scope="col" class="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">$.</td>
<td class="left">$INPUT_LINE_NUMBE</td>
<td class="left">最近一次执行读操作的当前行数</td>
</tr>

<tr>
<td class="left">$/</td>
<td class="left">$INPUT_RECORD_SEPARATOR</td>
<td class="left">输入记录分隔符,缺省是新行 chomp 取自变量"$/"</td>
</tr>

<tr>
<td class="left">$,</td>
<td class="left">$OUTPUT_FIELD_SEPARATOR</td>
<td class="left">print 操作的输出域分隔符</td>
</tr>

<tr>
<td class="left">$\</td>
<td class="left">$OUTPUT_RECORD_SEPARATOR</td>
<td class="left">print 操作的输出记录分隔符,通常用于省略换行符</td>
</tr>

<tr>
<td class="left">$"</td>
<td class="left">$LIST_SEPARATOR</td>
<td class="left">当数组转换成字符串时,元素缺省以空格分隔</td>
</tr>

<tr>
<td class="left">$^L</td>
<td class="left">$FORMAT_FORMFEED</td>
<td class="left">当执行一个进纸动作时输出的字符.缺省是\f</td>
</tr>

<tr>
<td class="left">$:</td>
<td class="left">$FORMAT_LINE_BREAK_CHARACTERS</td>
<td class="left">就是目前可以作为折行的字符集合.缺省值是\n(空白 换行 连字号)</td>
</tr>

<tr>
<td class="left">$^A</td>
<td class="left">$ACCUMULATOR</td>
<td class="left">格式化行的写收集器的当前值</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> 错误变量</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">变量</th>
<th scope="col" class="left">英文名</th>
<th scope="col" class="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">$?</td>
<td class="left">$CHILD_ERROR</td>
<td class="left">包含了最近一次执行的外部程序结束状态</td>
</tr>

<tr>
<td class="left">$!</td>
<td class="left">$OS_ERROR,$ERRNO</td>
<td class="left">包含了系统的错误.(错误码 或 错误信息)</td>
</tr>

<tr>
<td class="left">$\^E</td>
<td class="left">$EXTENDED_OS_ERROR</td>
<td class="left">在某些平台,返回扩展错误信息</td>
</tr>

<tr>
<td class="left">$@</td>
<td class="left">$EVAL_ERROR</td>
<td class="left">从上一个eval命令的Perl语法错误信息</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> 系统变量</h3>
<div class="outline-text-3" id="text-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">$ $</td>
<td class="left">$PROCESS_ID $PID</td>
<td class="left">运行当前Perl进程的pid</td>
</tr>

<tr>
<td class="left">$&lt;</td>
<td class="left">$REAL_USER_ID $UID</td>
<td class="left">当前进程的实际用户标识符(uid)</td>
</tr>

<tr>
<td class="left">$&gt;</td>
<td class="left">$EFFECTIVE_USER_ID $EUID</td>
<td class="left">当前进程的有效用户标识符</td>
</tr>

<tr>
<td class="left">$(</td>
<td class="left">$REAL_GROUP_ID $GID</td>
<td class="left">当前进程的实际组标识符(gid)</td>
</tr>

<tr>
<td class="left">$)</td>
<td class="left">$EFFECTIVE_GROUP_ID $EGID</td>
<td class="left">当前进程的有效组标识符</td>
</tr>

<tr>
<td class="left">$0</td>
<td class="left">$REOGRAM_NAME</td>
<td class="left">正在执行的Perl脚本的文件名称.</td>
</tr>

<tr>
<td class="left">$[</td>
<td class="left">&#xa0;</td>
<td class="left">数组中第一个元素的序号或字符串中第一个字符的序号.缺省是0</td>
</tr>

<tr>
<td class="left">$]</td>
<td class="left">$PERL_VERSION</td>
<td class="left">返回版本号,加上补丁级别除以1000</td>
</tr>

<tr>
<td class="left">$^D</td>
<td class="left">$DEBUGGING</td>
<td class="left">调试标志的当前值</td>
</tr>

<tr>
<td class="left">$^F</td>
<td class="left">$SYSTEM_FD_MAX</td>
<td class="left">最大的系统文件描述符,通常是2</td>
</tr>

<tr>
<td class="left">$^I</td>
<td class="left">$INPLACE_EDIT</td>
<td class="left">原地编辑扩展的当前值.可使用undef禁止原地编辑</td>
</tr>

<tr>
<td class="left">$^M</td>
<td class="left">&#xa0;</td>
<td class="left">$M的内容能用件紧急内存池,以便Perl</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">出out-of-memory错误时使用.使用$M要求Perl进行特殊的编译</td>
</tr>

<tr>
<td class="left">$^O</td>
<td class="left">$OSNAME</td>
<td class="left">编译Perl本身时的操作系统名称</td>
</tr>

<tr>
<td class="left">$^P</td>
<td class="left">$PERLDB</td>
<td class="left">是否打开调试</td>
</tr>

<tr>
<td class="left">$^T</td>
<td class="left">$BASETIME</td>
<td class="left">当前脚本开始进行的时间,以秒为单位,从1970年开始</td>
</tr>

<tr>
<td class="left">$^W</td>
<td class="left">$WARNING</td>
<td class="left">警告开关的当前值,真或假</td>
</tr>

<tr>
<td class="left">$^X</td>
<td class="left">$EXECUTABLE_NAME</td>
<td class="left">二进制Perl执行文件的名称</td>
</tr>

<tr>
<td class="left">$ARGV</td>
<td class="left">&#xa0;</td>
<td class="left">当从&lt;&gt;读入时的当前文件名</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 其它</h3>
<div class="outline-text-3" id="text-2-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">变量</th>
<th scope="col" class="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">@ARGV</td>
<td class="left">命令行参数</td>
</tr>

<tr>
<td class="left">$ARGV</td>
<td class="left">当前文件的文件名,代表标准输入&lt;STDIN&gt;</td>
</tr>

<tr>
<td class="left">@INC</td>
<td class="left">寻找Perl脚本的地址表</td>
</tr>

<tr>
<td class="left">%INC</td>
<td class="left">通过do或requir包含的文件名的目录</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
