learning/perl.org
** DONE 结合性、优先级
   | 结合性   | 操作符                                 |
   |----------+----------------------------------------|
   | 左       | 括号；给定参数的列表操作符             |
   | 左       | ->                                     |
   |          | ++ --                                  |
   | 右       | **(乘幂运算)                           |
   | 右       | \ ! ~ + -                              |
   | 左       | ＝~ ！~                                |
   | 左       | * / % x                                |
   | 左       | + - . (双目操作符)                     |
   | 左       | << >>                                  |
   | 无连接性 | 具名的单目操作符(-X文件测试; rand)     |
   | 无连接性 | < <= > >= lt le gt ge ("不相等操作符") |
   | 无连接性 | == != <=> eq ne cmp ("相等"操作符)     |
   | 左       | &                                      |
   | 左       | ｜ ^                                   |
   | 左       | &&                                     |
   | 左       |                                        |
   | 无连接性 | .. ...(范围)                           |
   | 右       | ?:                                     |
   | 右       | \= += -= .=                            |
   | 左       | , =>                                   |
   | 无连接性 | 列表操作符(向右结和)                   |
   | 右       | not                                    |
   | 左       | and                                    |
   | 左       | or xor                                 |
   
** DONE ~~ 智能匹配
   | 范例                      | 匹配类型                           |
   |---------------------------+------------------------------------|
   | %a ~~ %b                  | 哈希的键是否一致                   |
   | %a ~~ @b  @a ~~ %b        | %a中的至少一个键在列表@b中         |
   | %a ~~ /Fred/ /fred/ ~~ %b | 至少有一个键匹配给定的模式         |
   | 'fred' ~~ %a              | 是否存在$a{fred}                   |
   | @a ~~ @b                  | 数组是否相同                       |
   | @a ~~ /fred/              | @a中至少有一个元素匹配模式         |
   | $name ~~ undef   $name    | $name 没有定义                     |
   | $name ~~ /fred/           | 模式匹配                           |
   | 123 ~~ '123.0'            | 数值和"numish"类型的字符串是否相等 |
   | ' Fred' ~~ ' fred'        | 字符串是否相同                     |
   | 123 ~~ 456                | 数值是否相等                       |
   
** 按位运算操作符
   | 表达式   | 意义                                                        |
   |----------+-------------------------------------------------------------|
   | 10 & 12  | 按位与 哪些位在两边同时为真(此例得8)                        |
   |          | print 'a'&'_'; #得到A                                       |
   | 10 ｜ 12 | 按位或 哪些位在任一边为真(此例得14)                         |
   |          | print 'A'  \vert ''; #得到a  设置文件格式O_CREAT \vert O_TRUNC   |
   | 10 ^ 12  | 按位异或 哪些位在任何一边为真 但不能两边都为真(此例得6)     |
   | 6 << 2   | 按位左移 将左边操作数向左移动右操作数位,低位以0补(此例得24) |
   | 25 >> 2  | 按位右移 将左操作数向右移动右操作数位,丢弃低位(此例得6)     |
   | ~10      | 按位取反 返回逐位反相之后的值(此例得0xfffffff5 32位)        |
   
** 字符串操作符
   . 将两个字符串连接到一起 eg.  "hello world"."\n"
   x 将字符串重复几次      eg.  "fred" x 3
   右操作数在使用前会先取整
   对列表同样可用  @array=(1,2,3,4)x2; #@array=(1,2,3,4,1,2,3,4)
   
** 逻辑操作符
   | 操作符 | 命名 | 说明 |
   |--------+------+------+
   | \!     | not  | 非   |
   | \vert\vert  | or   | 或   |
   | &&     | and  | 与   |
   |        | xor  | 异或 |
** DONE 比较操作符
   | 比较     | 数字 | 字符串 | 返回值               |
   |----------+------+--------+----------------------|
   | 相等     | ==   | eq     | 相等返回真           |
   | 不等     | ！=  | ne     | 不等返回真           |
   | 小于     | <    | lt     | 小于返回真           |
   | 大于     | >    | gt     | 大于返回真           |
   | 小于等于 | <=   | le     | 不小于返回真         |
   | 大于等于 | >=   | ge     | 不大于返回真         |
   | 比较     | <=>  | cmp    | 相等为0,大为1,小为-1 |
   
* 变量
** 基础知识
*** 数字
   未赋值的标量 undef 作为数字时为0
   0377 (oct)
   0xff (hex)
   0b11111111 (bin)    都表示255(dec)
   可以用 hex oct 转换为10进制
   sprintf 将10进制转换为2(%b) 8(%o) 16(%x)进制
   整数直接量允许插入_便于阅读(非十进制也可以)
   eg. 61_298_768
   
** here 文档
   here 文档定义一个字符串,它的结束符用紧接着<<的符号定义,
   这个符号可以用双引号或单引号括起来.同时它支持插值
   
   here 文档仅仅是引号的一种可替代的形式.
   在你可以使用单引号或者双引号的地方就可以使用here文档.
+ eg.
  #+begin_src perl
  my $price = 'right';
  #here docuemnts
  print <<EOF;
  The price is $price.
  EOF

  #+end_src
  结果将打印出: The price is right.
  #+begin_src perl
  use strict;
  my $someURL = 'http://www.perl.com';
  my $html = <<ENDHTML;
  <HTML>
  <BODY>
  <P><A HREF="$someURL">Perl Homepage</A></P>
  </BODY>
  </HTML>
  ENDHTML
  open (DATAFILE, ">data.file")||die "could not open 'data.file' $!";
  print DATAFILE $html;  #print to file
  close(DATAFILE);
  #+end_src
