learning/perl.html

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 操作符</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> <span class="done DONE">DONE</span> 结合性、优先级</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">结合性</th>
<th scope="col" class="left">操作符</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">左</td>
<td class="left">括号；给定参数的列表操作符</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">-&gt;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">++ --</td>
</tr>

<tr>
<td class="left">右</td>
<td class="left">**(乘幂运算)</td>
</tr>

<tr>
<td class="left">右</td>
<td class="left">\ ! ~ + -</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">＝~ ！~</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">* / % x</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">+ - . (双目操作符)</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left"><a id="" name=""></a></td>
</tr>

<tr>
<td class="left">无连接性</td>
<td class="left">具名的单目操作符(-X文件测试; rand)</td>
</tr>

<tr>
<td class="left">无连接性</td>
<td class="left">&lt; &lt;= &gt; &gt;= lt le gt ge ("不相等操作符")</td>
</tr>

<tr>
<td class="left">无连接性</td>
<td class="left"><code>= !</code> &lt;=&gt; eq ne cmp ("相等"操作符)</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">&amp;</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">｜ ^</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">&amp;&amp;</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">无连接性</td>
<td class="left">.. &#x2026;(范围)</td>
</tr>

<tr>
<td class="left">右</td>
<td class="left">?:</td>
</tr>

<tr>
<td class="left">右</td>
<td class="left">\= += -= .=</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">, =&gt;</td>
</tr>

<tr>
<td class="left">无连接性</td>
<td class="left">列表操作符(向右结和)</td>
</tr>

<tr>
<td class="left">右</td>
<td class="left">not</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">and</td>
</tr>

<tr>
<td class="left">左</td>
<td class="left">or xor</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> <span class="done DONE">DONE</span> ~~ 智能匹配</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">范例</th>
<th scope="col" class="left">匹配类型</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">%a ~~ %b</td>
<td class="left">哈希的键是否一致</td>
</tr>

<tr>
<td class="left">%a <code>~ @b  @a ~</code> %b</td>
<td class="left">%a中的至少一个键在列表@b中</td>
</tr>

<tr>
<td class="left">%a <code>~ /Fred/ /fred/ ~</code> %b</td>
<td class="left">至少有一个键匹配给定的模式</td>
</tr>

<tr>
<td class="left">'fred' ~~ %a</td>
<td class="left">是否存在$a{fred}</td>
</tr>

<tr>
<td class="left">@a ~~ @b</td>
<td class="left">数组是否相同</td>
</tr>

<tr>
<td class="left">@a ~~ <i>fred</i></td>
<td class="left">@a中至少有一个元素匹配模式</td>
</tr>

<tr>
<td class="left">$name ~~ undef   $name</td>
<td class="left">$name 没有定义</td>
</tr>

<tr>
<td class="left">$name ~~ <i>fred</i></td>
<td class="left">模式匹配</td>
</tr>

<tr>
<td class="left">123 ~~ '123.0'</td>
<td class="left">数值和"numish"类型的字符串是否相等</td>
</tr>

<tr>
<td class="left">' Fred' ~~ ' fred'</td>
<td class="left">字符串是否相同</td>
</tr>

<tr>
<td class="left">123 ~~ 456</td>
<td class="left">数值是否相等</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> 按位运算操作符</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">表达式</th>
<th scope="col" class="left">意义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">10 &amp; 12</td>
<td class="left">按位与 哪些位在两边同时为真(此例得8)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">print 'a'&amp;'_'; #得到A</td>
</tr>

<tr>
<td class="left">10 ｜ 12</td>
<td class="left">按位或 哪些位在任一边为真(此例得14)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">print 'A'  &vert; ''; #得到a  设置文件格式O_CREAT &vert; O_TRUNC</td>
</tr>

<tr>
<td class="left">10 ^ 12</td>
<td class="left">按位异或 哪些位在任何一边为真 但不能两边都为真(此例得6)</td>
</tr>

<tr>
<td class="left">6 &lt;&lt; 2</td>
<td class="left">按位左移 将左边操作数向左移动右操作数位,低位以0补(此例得24)</td>
</tr>

<tr>
<td class="left">25 &gt;&gt; 2</td>
<td class="left">按位右移 将左操作数向右移动右操作数位,丢弃低位(此例得6)</td>
</tr>

<tr>
<td class="left">~10</td>
<td class="left">按位取反 返回逐位反相之后的值(此例得0xfffffff5 32位)</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> 字符串操作符</h3>
<div class="outline-text-3" id="text-3-4">
<p>
. 将两个字符串连接到一起 eg.  "hello world"."\n"<br  />
x 将字符串重复几次      eg.  "fred" x 3<br  />
右操作数在使用前会先取整<br  />
对列表同样可用  @array=(1,2,3,4)x2; #@array=(1,2,3,4,1,2,3,4)<br  />
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> 逻辑操作符</h3>
<div class="outline-text-3" id="text-3-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">操作符</th>
<th scope="col" class="left">命名</th>
<th scope="col" class="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">\!</td>
<td class="left">not</td>
<td class="left">非</td>
</tr>

<tr>
<td class="left">&vert;&vert;</td>
<td class="left">or</td>
<td class="left">或</td>
</tr>

<tr>
<td class="left">&amp;&amp;</td>
<td class="left">and</td>
<td class="left">与</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">xor</td>
<td class="left">异或</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> <span class="done DONE">DONE</span> 比较操作符</h3>
<div class="outline-text-3" id="text-3-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">比较</th>
<th scope="col" class="left">数字</th>
<th scope="col" class="left">字符串</th>
<th scope="col" class="left">返回值</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">相等</td>
<td class="left">==</td>
<td class="left">eq</td>
<td class="left">相等返回真</td>
</tr>

<tr>
<td class="left">不等</td>
<td class="left">！=</td>
<td class="left">ne</td>
<td class="left">不等返回真</td>
</tr>

<tr>
<td class="left">小于</td>
<td class="left">&lt;</td>
<td class="left">lt</td>
<td class="left">小于返回真</td>
</tr>

<tr>
<td class="left">大于</td>
<td class="left">&gt;</td>
<td class="left">gt</td>
<td class="left">大于返回真</td>
</tr>

<tr>
<td class="left">小于等于</td>
<td class="left">&lt;=</td>
<td class="left">le</td>
<td class="left">不小于返回真</td>
</tr>

<tr>
<td class="left">大于等于</td>
<td class="left">&gt;=</td>
<td class="left">ge</td>
<td class="left">不大于返回真</td>
</tr>

<tr>
<td class="left">比较</td>
<td class="left">&lt;=&gt;</td>
<td class="left">cmp</td>
<td class="left">相等为0,大为1,小为-1</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 变量</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 基础知识</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> 数字</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
未赋值的标量 undef 作为数字时为0<br  />
0377 (oct)<br  />
0xff (hex)<br  />
0b11111111 (bin)    都表示255(dec)<br  />
可以用 hex oct 转换为10进制<br  />
sprintf 将10进制转换为2(%b) 8(%o) 16(%x)进制<br  />
整数直接量允许插入_便于阅读(非十进制也可以)<br  />
eg. 61_298_768<br  />
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> here 文档</h3>
<div class="outline-text-3" id="text-4-2">
<p>
here 文档定义一个字符串,它的结束符用紧接着&lt;&lt;的符号定义,<br  />
这个符号可以用双引号或单引号括起来.同时它支持插值<br  />
</p>

<p>
here 文档仅仅是引号的一种可替代的形式.<br  />
在你可以使用单引号或者双引号的地方就可以使用here文档.<br  />
</p>
<ul class="org-ul">
<li>eg.<br  />
<div class="org-src-container">

<pre class="src src-perl">my $price = 'right';
#here docuemnts
print &lt;&lt;EOF;
The price is $price.
EOF
</pre>
</div>
<p>
结果将打印出: The price is right.<br  />
</p>
<div class="org-src-container">

<pre class="src src-perl">use strict;
my $someURL = 'http://www.perl.com';
my $html = &lt;&lt;ENDHTML;
&lt;HTML&gt;
&lt;BODY&gt;
&lt;P&gt;&lt;A HREF="$someURL"&gt;Perl Homepage&lt;/A&gt;&lt;/P&gt;
&lt;/BODY&gt;
&lt;/HTML&gt;
ENDHTML
open (DATAFILE, "&gt;data.file")||die "could not open 'data.file' $!";
print DATAFILE $html;  #print to file
close(DATAFILE);
</pre>
</div>
</li>
</ul>
</div>
</div>
