learning/perl.org
** 双引号内的\转义
   | 组合    | 意义                              |
   |---------+-----------------------------------|
   | \n      | 换行                              |
   | \r      | 回车                              |
   | \t      | 制表符                            |
   | \f      | 换页符                            |
   | \b      | 退格                              |
   | \a      | 系统响铃                          |
   | \e      | Esc                               |
   | \007    | oct 表示的ASCII值(响铃)           |
   | \x7f    | hex 表示的ASCII值(删除键代码)     |
   | \{2744} | hex unicode代码点(雪花）          |
   | \cC     | 控制符 Control                    |
   | \\      | 反斜线                            |
   | \       | 双引号                            |
   | \l      | 下个字母小写                      |
   | \L      | 后面所有字母小写直到\E            |
   | \u      | 下个字母大写                      |
   | \U      | 后面所有字母大写直到\E            |
   | \Q      | 把它到\E之间的非单词字符加上\转义 |
   | \E      | 作为\L \U \Q 的结束               |
   
* 列表与数组
** 基础知识
+ 列表直接量
  (1, 2, 3, 4)
  (1..5)
  (1.7..5.7)     同上(取整)
  (1, 2..5)
  (5..1)         空
+ qw 简写
  eg. qw(fred barney betty)
  或 qw() qw!! qw// qw## qw[] qw{} qw<> 等
+ 索引
  访问越界  返回undef
  为索引值超过数组尾端的元素赋值 数组会自动扩大 中间补充元素为undef
  $#   最大索引值
  负数索引值  从数组尾端往回计数(最后一个元素 索引值 -1)
+ print
  print @array;  打印列表 各元素之间没有空格
  print "@array"; 打印列表 各元素之间有空格
  print @array."\n" @array 打印元素个数
** 函数
+ pop(出) push(入) 对数组尾端进行操作
+ shift(出) unshift(入) 对数组头进行操作
+ splice 对数组中间元素   删除、添加
  splice array, offset, length, list
  
+ reverse  将列表倒序输出 不改变原来的顺序
+ sort     ASCII 码排序   也可以自定义排序方法
  #+begin_src perl
  #按字典方式排序
  @articles = sort @files;
  #实现同样的目的,但是使用了显式的排序函数
  @articles = sort{$a cmp $b} @files;
  #现在是大小写不敏感
  @articles = sort{uc($a) cmp uc($b)} @files;
  #现在是倒排序
  @articles = sort{$b cmp $a} @files;
  #按数字递增方式排序
  @articles = sort{$a <=> $b} @files;
  #按数字递减方式排序
  @articles = sort{$b <=> $a} @files;
  #现在使用内联函数按照值而不是关键字的方式排序哈希表 %aeg
  @eldest = sort{$age{$b} <=> $age{$a}} keys %age;
  #+end_src
+ map EXPR, list 对列表中的每个元素执行EXPR
  #+begin_src perl
  @numbers = (80, 101, 114, 108);
  @characters = map(chr $_, @numbers);

  #+end_src
+ split 将根据指定的模式拆分字符串
  my @fields = split /separator/, $string;
  默认以空白符分隔$_ 中的字符串
  #+begin_src perl
  my @fields = split /:/, "abc:def:g:h"; #得到("abc", "def", "g", "h")
  my @fields = split;   #my @fields = split /\s+/, $_

  #+end_src
  
+ join 与split 刚好相反
  my $result = join $glue, @pieces;
  
+ scalar 返回数组大小
  #+begin_src perl
  @names = (Jo, Pete, Bill, Zeke, All);
  print scalar(@names);   #6
  
  #+end_src
  
+ delete 清空该位置的元素,但不改变各元素的位置
  #+begin_src perl
  my @array = (0, 1, 2, 3, 4, 5, 6);
  delete $array[3];
  print jion(':', @array)."\n";  #0:1:2::4:5:6

  #+end_src
+ exists 判断该元素是否存在
  defined 判断该元素是否为undef
  元素被delete后 exitsts返回 false
  一个元素为undef exitsts返回 true
  
+ chop 每一个元素去掉最后一个字符
* 哈希 散列
** TODO 基础知识
   key 唯一 value 可以重复  key 只能是字符串
   可以直接赋值  %new_hash = %old_hash
   %ip_address = reverse %host_name;  #reverse 可以实现键值反转
   使用 => 时 key 的引号可以省略
   #+begin_src perl
my %last_name = {
    fred   => 'flintstone',
    dino   => undef,
    barney => 'rubble',
    betty  => 'rubble',
}
   #+end_src
   %ENV 哈希
** TODO 函数
+ keys values 函数 可以返回哈希键值列表
  my @k = keys %hash;
  my @v = values %hash;
+ each foreach
  whiel(($key, $value) = each %hash){ }
+ delete 删除指定的键及其相对应的值 
* TODO 数据结构
+ [] 将一个列表当成一个标量
  #+BEGIN_SRC perl
  $wife{"Jacob"} = ["Leah", "Rachel", "Bilhah", "Zilpah"];
  or
  $wife{"Jacob"}[0] = "Leah";
  $wife{"Jacob"}[1] = "Rachel";
  #+END_SRC
+ {} 将哈希当成一个标量
  #+BEGIN_SRC perl
  $kids_of_wife{"Jacob"} = {
      "Leah" => ["Reuben", "Simeon", "Levi", "Judah", "Issachar", "Zebulun"],
      "Rachel" => ["Joseph", "Benjamin"],
      "Bilhah" => ["Dan", "Naphtali"],
      "Zilpah" => ["Gad", "Asher"],
  };
  or
  $kids_of_wife{"Jacob"}{"Leah"}[0] = "Reuben";
  $kids_of_wife{"Jacob"}{"Leah"}[1] = "Simeon";
  #+END_SRC
  
* 引用
  perl中有两种引用:硬引用和符号引用,因为符号引用被use strict禁止了,
  所以一般的引用都是指硬引用
  创建 使用反斜杠操作符可以创建引用.\相当于c语言中的&
  $numberref = \42;
  $messageref = \"hello ref";
  [...]{...}创建一个指向数组或hash的引用,
  它们创建一个自己内容的副本并返回指向它的一个引用,所以与\操作符不一样
  @array = [1,2,3,4];
  @copyhasref = {%hash};
+ 访问 $相当于c中的*,用于访问引用指向的值
  各种类型的引用
  | 引用     | 例子                                           |
  |----------+------------------------------------------------|
  | 标量引用 | $ra = \$ra; #指向标量的引用                    |
  |          | $$ra = 2; #标量引用解引用                      |
  |          | $ra = \1.6; #指向常量的引用                    |
  | 数组引用 | $rl = \@l; #指向已存在数组的引用               |
  |          | $rl = [1,2,3]; #指向匿名数组的引用             |
  |          | push(@$rl,"a"); #解引用                        |
  |          | print $rl->[3]; #$rl 指向的数组的第四个元素    |
  | 哈希引用 | $rh = \%h; #指向hash的引用                     |
  |          | $rh = {"laurel"=>"hardy"}; #指向匿名hash的引用 |
  |          | print keys(%$rh); #解引用                      |
  |          | $x = $rh->{"laurel"}; #取得单个元素的箭头符号  |
  |          | @slice = @$rh{"laurel","romeo"); #hash 片断    |
  | 代码引用 | $rs = \&foo;                                   |
  |          | $rs = sub {print "foo"};                       |
  |          | &$rs();                                        |
+ 通过ref函数返回引用的类型
  $ref = \[1,2,3,4];
  print "ref type ".ref($ref);
  该函数的返回值
  | SCALAR | 标量引用     |
  | ARRAY  | 数组引用     |
  | HASH   | hash引用     |
  | CODE   | 例程引用     |
  | GLOB   | Typeglob引用 |
  | IO     | 文件句柄引用 |
  | REF    | 指向另一个引用 |
  | LVALUE | 除了SCALAR ARRAY HASH之外的可分配的值 |
  
* TODO 子程序
* string 操作
