learning/perl.html
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> 双引号内的\转义</h3>
<div class="outline-text-3" id="text-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">组合</th>
<th scope="col" class="left">意义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">\n</td>
<td class="left">换行</td>
</tr>

<tr>
<td class="left">\r</td>
<td class="left">回车</td>
</tr>

<tr>
<td class="left">\t</td>
<td class="left">制表符</td>
</tr>

<tr>
<td class="left">\f</td>
<td class="left">换页符</td>
</tr>

<tr>
<td class="left">\b</td>
<td class="left">退格</td>
</tr>

<tr>
<td class="left">\a</td>
<td class="left">系统响铃</td>
</tr>

<tr>
<td class="left">\e</td>
<td class="left">Esc</td>
</tr>

<tr>
<td class="left">\007</td>
<td class="left">oct 表示的ASCII值(响铃)</td>
</tr>

<tr>
<td class="left">\x7f</td>
<td class="left">hex 表示的ASCII值(删除键代码)</td>
</tr>

<tr>
<td class="left">\{2744}</td>
<td class="left">hex unicode代码点(雪花）</td>
</tr>

<tr>
<td class="left">\cC</td>
<td class="left">控制符 Control</td>
</tr>

<tr>
<td class="left">\\</td>
<td class="left">反斜线</td>
</tr>

<tr>
<td class="left">\</td>
<td class="left">双引号</td>
</tr>

<tr>
<td class="left">\l</td>
<td class="left">下个字母小写</td>
</tr>

<tr>
<td class="left">\L</td>
<td class="left">后面所有字母小写直到\E</td>
</tr>

<tr>
<td class="left">\u</td>
<td class="left">下个字母大写</td>
</tr>

<tr>
<td class="left">\U</td>
<td class="left">后面所有字母大写直到\E</td>
</tr>

<tr>
<td class="left">\Q</td>
<td class="left">把它到\E之间的非单词字符加上\转义</td>
</tr>

<tr>
<td class="left">\E</td>
<td class="left">作为\L \U \Q 的结束</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 列表与数组</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> 基础知识</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>列表直接量<br  />
(1, 2, 3, 4)<br  />
(1..5)<br  />
(1.7..5.7)     同上(取整)<br  />
(1, 2..5)<br  />
(5..1)         空<br  />
</li>
<li>qw 简写<br  />
eg. qw(fred barney betty)<br  />
或 qw() qw!! qw// qw## qw[] qw{} qw&lt;&gt; 等<br  />
</li>
<li>索引<br  />
访问越界  返回undef<br  />
为索引值超过数组尾端的元素赋值 数组会自动扩大 中间补充元素为undef<br  />
$#   最大索引值<br  />
负数索引值  从数组尾端往回计数(最后一个元素 索引值 -1)<br  />
</li>
<li>print<br  />
print @array;  打印列表 各元素之间没有空格<br  />
print "@array"; 打印列表 各元素之间有空格<br  />
print @array."\n" @array 打印元素个数<br  />
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> 函数</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>pop(出) push(入) 对数组尾端进行操作<br  />
</li>
<li>shift(出) unshift(入) 对数组头进行操作<br  />
</li>
<li>splice 对数组中间元素   删除、添加<br  />
splice array, offset, length, list<br  />
</li>

<li>reverse  将列表倒序输出 不改变原来的顺序<br  />
</li>
<li>sort     ASCII 码排序   也可以自定义排序方法<br  />
<div class="org-src-container">

<pre class="src src-perl">#按字典方式排序
@articles = sort @files;
#实现同样的目的,但是使用了显式的排序函数
@articles = sort{$a cmp $b} @files;
#现在是大小写不敏感
@articles = sort{uc($a) cmp uc($b)} @files;
#现在是倒排序
@articles = sort{$b cmp $a} @files;
#按数字递增方式排序
@articles = sort{$a &lt;=&gt; $b} @files;
#按数字递减方式排序
@articles = sort{$b &lt;=&gt; $a} @files;
#现在使用内联函数按照值而不是关键字的方式排序哈希表 %aeg
@eldest = sort{$age{$b} &lt;=&gt; $age{$a}} keys %age;
</pre>
</div>
</li>
<li>map EXPR, list 对列表中的每个元素执行EXPR<br  />
<div class="org-src-container">

<pre class="src src-perl">@numbers = (80, 101, 114, 108);
@characters = map(chr $_, @numbers);
</pre>
</div>
</li>
<li>split 将根据指定的模式拆分字符串<br  />
my @fields = split <i>separator</i>, $string;<br  />
默认以空白符分隔$_ 中的字符串<br  />
<div class="org-src-container">

<pre class="src src-perl">my @fields = split /:/, "abc:def:g:h"; #得到("abc", "def", "g", "h")
my @fields = split;   #my @fields = split /\s+/, $_
</pre>
</div>
</li>

<li>join 与split 刚好相反<br  />
my $result = join $glue, @pieces;<br  />
</li>

<li>scalar 返回数组大小<br  />
<div class="org-src-container">

<pre class="src src-perl">@names = (Jo, Pete, Bill, Zeke, All);
print scalar(@names);   #6
</pre>
</div>
</li>

<li>delete 清空该位置的元素,但不改变各元素的位置<br  />
<div class="org-src-container">

<pre class="src src-perl">my @array = (0, 1, 2, 3, 4, 5, 6);
delete $array[3];
print jion(':', @array)."\n";  #0:1:2::4:5:6
</pre>
</div>
</li>
<li>exists 判断该元素是否存在<br  />
defined 判断该元素是否为undef<br  />
元素被delete后 exitsts返回 false<br  />
一个元素为undef exitsts返回 true<br  />
</li>

<li>chop 每一个元素去掉最后一个字符<br  />
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 哈希 散列</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> <span class="todo TODO">TODO</span> 基础知识</h3>
<div class="outline-text-3" id="text-6-1">
<p>
key 唯一 value 可以重复  key 只能是字符串<br  />
可以直接赋值  %new_hash = %old_hash<br  />
%ip_address = reverse %host_name;  #reverse 可以实现键值反转<br  />
使用 =&gt; 时 key 的引号可以省略<br  />
</p>
<div class="org-src-container">

<pre class="src src-perl">my %last_name = {
    fred   =&gt; 'flintstone',
    dino   =&gt; undef,
    barney =&gt; 'rubble',
    betty  =&gt; 'rubble',
}
</pre>
</div>
<p>
%ENV 哈希<br  />
</p>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> <span class="todo TODO">TODO</span> 函数</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li>keys values 函数 可以返回哈希键值列表<br  />
my @k = keys %hash;<br  />
my @v = values %hash;<br  />
</li>
<li>each foreach<br  />
whiel(($key, $value) = each %hash){ }<br  />
</li>
<li>delete 删除指定的键及其相对应的值<br  />
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> 数据结构</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>[] 将一个列表当成一个标量<br  />
<div class="org-src-container">

<pre class="src src-perl">$wife{"Jacob"} = ["Leah", "Rachel", "Bilhah", "Zilpah"];
or
$wife{"Jacob"}[0] = "Leah";
$wife{"Jacob"}[1] = "Rachel";
</pre>
</div>
</li>
<li>{} 将哈希当成一个标量<br  />
<div class="org-src-container">

<pre class="src src-perl">$kids_of_wife{"Jacob"} = {
    "Leah" =&gt; ["Reuben", "Simeon", "Levi", "Judah", "Issachar", "Zebulun"],
    "Rachel" =&gt; ["Joseph", "Benjamin"],
    "Bilhah" =&gt; ["Dan", "Naphtali"],
    "Zilpah" =&gt; ["Gad", "Asher"],
};
or
$kids_of_wife{"Jacob"}{"Leah"}[0] = "Reuben";
$kids_of_wife{"Jacob"}{"Leah"}[1] = "Simeon";
</pre>
</div>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 引用</h2>
<div class="outline-text-2" id="text-8">
<p>
perl中有两种引用:硬引用和符号引用,因为符号引用被use strict禁止了,<br  />
所以一般的引用都是指硬引用<br  />
创建 使用反斜杠操作符可以创建引用.\相当于c语言中的&amp;<br  />
$numberref = \42;<br  />
$messageref = \"hello ref";<br  />
[&#x2026;]{&#x2026;}创建一个指向数组或hash的引用,<br  />
它们创建一个自己内容的副本并返回指向它的一个引用,所以与\操作符不一样<br  />
@array = [1,2,3,4];<br  />
@copyhasref = {%hash};<br  />
</p>
<ul class="org-ul">
<li>访问 $相当于c中的*,用于访问引用指向的值<br  />
各种类型的引用<br  />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">引用</th>
<th scope="col" class="left">例子</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">标量引用</td>
<td class="left">$ra = \$ra; #指向标量的引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">$$ra = 2; #标量引用解引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">$ra = \1.6; #指向常量的引用</td>
</tr>

<tr>
<td class="left">数组引用</td>
<td class="left">$rl = \@l; #指向已存在数组的引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">$rl = [1,2,3]; #指向匿名数组的引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">push(@$rl,"a"); #解引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">print $rl-&gt;<sup><a id="fnr.3" name="fnr.3" class="footref" href="#fn.3">3</a></sup>; #$rl 指向的数组的第四个元素</td>
</tr>

<tr>
<td class="left">哈希引用</td>
<td class="left">$rh = \%h; #指向hash的引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">$rh = {"laurel"=&gt;"hardy"}; #指向匿名hash的引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">print keys(%$rh); #解引用</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">$x = $rh-&gt;{"laurel"}; #取得单个元素的箭头符号</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">@slice = @$rh{"laurel","romeo"); #hash 片断</td>
</tr>

<tr>
<td class="left">代码引用</td>
<td class="left">$rs = \&amp;foo;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">$rs = sub {print "foo"};</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">&amp;$rs();</td>
</tr>
</tbody>
</table>
</li>
<li>通过ref函数返回引用的类型<br  />
$ref = \[1,2,3,4];<br  />
print "ref type ".ref($ref);<br  />
该函数的返回值<br  />
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">SCALAR</td>
<td class="left">标量引用</td>
</tr>

<tr>
<td class="left">ARRAY</td>
<td class="left">数组引用</td>
</tr>

<tr>
<td class="left">HASH</td>
<td class="left">hash引用</td>
</tr>

<tr>
<td class="left">CODE</td>
<td class="left">例程引用</td>
</tr>

<tr>
<td class="left">GLOB</td>
<td class="left">Typeglob引用</td>
</tr>

<tr>
<td class="left">IO</td>
<td class="left">文件句柄引用</td>
</tr>

<tr>
<td class="left">REF</td>
<td class="left">指向另一个引用</td>
</tr>

<tr>
<td class="left">LVALUE</td>
<td class="left">除了SCALAR ARRAY HASH之外的可分配的值</td>
</tr>
</tbody>
</table>
</li>
</ul>
</div>
</div>
