learning/perl.org
** 基本操作
   $str =~ tr///;  对应替换
   (substr $str, , ) = "...";  替换 substr 截取子串
   my $pos = index $str, $subs; $subs在$str的位置
   my $pos = rindex $str, $subs; 从右边起第一次出现的$subs 在$str的位置
   
   split(match operand, target string, chunk-limit operand)
   match operand 为' '时，相当于/\s+/
   split(" ", "  a short   test   ")得到('a', 'short', 'test')
   使用 \s+ 会保留开始的空白字符
   如果没有设置regex运算元,则默认使用一个空格符
   regex为空,把目标字符串分割为字符
   chunk-limit operand 切分字符串的上限
   保留结尾的空白字符可以将chunk-limit设为－1
   当split中带捕获型括号的match运算元时返回的list中会多出些独立的元素,
   多出的元素不受分段上限的限制.如果含有多个捕获型括号会多出多个元素,
   未参与匹配的捕获型括号对应的元素为undef.
   
   chop       去掉字符串的最后一个字符
   chomp()    去掉字符串末尾的换行符
** 字符操作
   chr(0x05D0) 将代码点转换成对应的字符 reverse ord
   ord EXPR 返回EXPR第一个字符的代码点
   
** 大小写转换
   lc EXPR 转换为小写
   uc EXPR 转换为大写
   ucfirst EXPR 将首字母转换为大写
   lcfirst EXPR 将首字母转换为小写
* 文件目录及IO
** TODO glob
** DONE 文件测试
   | 文件测试操作符 | 意义                                                     |
   |----------------+----------------------------------------------------------|
   | -r             | 文件或目录,对目前(有效的)用户或组来说是可读的            |
   | -w             | 文件或目录,对目前(有效的)用户或组来说是可写的            |
   | -x             | 文件或目录,对目前(有效的)用户或组来说是可执行的          |
   | -o             | 文件或目录,由目前(有效的)用户拥有                        |
   | -R             | 文件或目录,对实际的用户或组来说是可读的                  |
   | -W             | 文件或目录,对实际的用户或组来说是可写的                  |
   | -X             | 文件或目录,对实际的用户或组来说是可执行的                |
   | -O             | 文件或目录,由实际的用户拥有                              |
   | -e             | 文件或目录,是存在的                                      |
   | -z             | 文件存在而且没有内容(对目录来说永远为假                  |
   | -s             | 文件或目录存在而且有内容(返回值是以字节为单位的文件大小) |
   | -f             | 是普通文件                                               |
   | -d             | 是目录                                                   |
   | -l             | 是符号链接                                               |
   | -S             | 是socket类型的文件                                       |
   | -p             | 是命名管道,也就是先入先出(fifo)队列                      |
   | -b             | 是块设备文件(比如某个可挂臷的磁盘)                       |
   | -c             | 是字符设备文件(比如某个I/O设备)                          |
   | -u             | 文件或目录设置了setuid位                                 |
   | -g             | 文件或目录设置了setgid位                                 |
   | -k             | 文件或目录设置了sticky位                                 |
   | -t             | 文件句柄是TTY设备(类似系统函数isatty()的测试;            |
   |                | 不能对文件名进行此测试)                                  |
   | -T             | 看起来像文本文件                                         |
   | -B             | 看起来像二进制文件                                       |
   | -M             | 最后一次被修改后至今的天数                               |
   | -A             | 最后一次被访问后至今的天数                               |
   | -C             | 最后一次文件节点编号(inode)被变更后至今的天数            |
** TODO 文件操作
+ rename 重命名
  rename 'old', 'new';  同时 , 也可以用 => 即 rename 'old' => 'new';
+ unlink 删除文件
  unlink + 文件列表: unlink 'slate', 'lava'; 或 qw//  或  glob 
** stat lstat 获得文件的属性
   如果所传参数为符号链接,stat返回的是符号链接指向的对象的属性,
   而非符号链接本身的属性.如果想得到符号链接的属性则使用lstat函数
   Return a 13-elements list
   ($dev,$ino,$mode,$nlink,$uid,$gid,$rdev,$size,
   $atime,$mtime,$ctime,$blksize,$blocks) = stat($filename);
   | 0 dev      | device number of filesystem                      |
   | 1 ino      | inode number                                     |
   | 2 mode     | file mode  (type and permissions)                |
   | 3 nlink    | number of (hard) links to the file               |
   | 4 uid      | numeric user ID of file's owner                  |
   | 5 gid      | numeric group ID of file's owner                 |
   | 6 rdev     | the device identifier (special files only)       |
   | 7 size     | total size of file, in bytes                     |
   | 8 atime    | last access time in seconds since the epoch      |
   | 9 mtime    | last modify time in seconds since the epoch      |
   | 10 ctime   | inode change time in seconds since the epoch (*) |
   | 11 blksize | preferred block size for file system I/O         |
   | 12 blocks  | actual number of blocks allocated                |
   
** TODO 目录
   chdir 相当于 cd 改变当前工作目录
   chdir '/etc' or die "cannot chdir to /etc: $!";
** 文件句柄
   <STDIN>    行输入 操作
   $line = <DATA> 读取一行
   @array = <DATA> 读入数组
+ _ 虚拟文件句柄 (用上次查询过的文件信息来做当前测试)
  测试同一文件的多项属性
  if(-r $file and -w _)
  可以在不同的语句中使用
* 一些函数
** 日期函数
   | 函数           | 说明                                                         |
   |----------------+------------------------------------------------------------- |
   | time           | 返回1970年1月1日起经过无跳跃秒数                             |
   |                | 可以用gmtime和localtime做进一步处理                          |
   | times          | 返回一个四个元素的列表,给出当前进程及其子进程用户和系统时间, |
   |                | 精确到秒                                                     |
   |                | ($uer, $system, $cuser, $csystem) = times                    |
   |                | 在标量上下文中,times 返回$user                               |
   | localtime EXPR | 把一个由time函数返回的时间转换成一个9个元素的列表,           |
   |                | 同时把该时间按照本地时区转换                                 |
   |                | ($sec,$min,$hour,$mday,$mon,$year,$wday,$yday,$isdst) =      |
   |                | localtime(time)                                              |
   |                | 取得当前时间:$time = locatime; print $time;                  |
   | gmtime EXPR    | 把一个由time 函数返回的时间转换成一个8个元素的列表,同时      |
   |                | 把该时间转化成标准的格林威治时区时间                         |
   
** 简单
   defined    判断是否为 undef 是返回假 否返回真

* 结构控制
