learning/perl.html

<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> <span class="todo TODO">TODO</span> 子程序</h2>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> string 操作</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-sec-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> 基本操作</h3>
<div class="outline-text-3" id="text-10-1">
<p>
$str =~ tr///;  对应替换<br  />
(substr $str, , ) = "&#x2026;";  替换 substr 截取子串<br  />
my $pos = index $str, $subs; $subs在$str的位置<br  />
my $pos = rindex $str, $subs; 从右边起第一次出现的$subs 在$str的位置<br  />
</p>

<p>
split(match operand, target string, chunk-limit operand)<br  />
match operand 为' '时，相当于/\s+/<br  />
split(" ", "  a short   test   ")得到('a', 'short', 'test')<br  />
使用 \s+ 会保留开始的空白字符<br  />
如果没有设置regex运算元,则默认使用一个空格符<br  />
regex为空,把目标字符串分割为字符<br  />
chunk-limit operand 切分字符串的上限<br  />
保留结尾的空白字符可以将chunk-limit设为－1<br  />
当split中带捕获型括号的match运算元时返回的list中会多出些独立的元素,<br  />
多出的元素不受分段上限的限制.如果含有多个捕获型括号会多出多个元素,<br  />
未参与匹配的捕获型括号对应的元素为undef.<br  />
</p>

<p>
chop       去掉字符串的最后一个字符<br  />
chomp()    去掉字符串末尾的换行符<br  />
</p>
</div>
</div>
<div id="outline-container-sec-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> 字符操作</h3>
<div class="outline-text-3" id="text-10-2">
<p>
chr(0x05D0) 将代码点转换成对应的字符 reverse ord<br  />
ord EXPR 返回EXPR第一个字符的代码点<br  />
</p>
</div>
</div>

<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> 大小写转换</h3>
<div class="outline-text-3" id="text-10-3">
<p>
lc EXPR 转换为小写<br  />
uc EXPR 转换为大写<br  />
ucfirst EXPR 将首字母转换为大写<br  />
lcfirst EXPR 将首字母转换为小写<br  />
</p>
</div>
</div>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> 文件目录及IO</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> <span class="todo TODO">TODO</span> glob</h3>
</div>
<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> <span class="done DONE">DONE</span> 文件测试</h3>
<div class="outline-text-3" id="text-11-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">文件测试操作符</th>
<th scope="col" class="left">意义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">-r</td>
<td class="left">文件或目录,对目前(有效的)用户或组来说是可读的</td>
</tr>

<tr>
<td class="left">-w</td>
<td class="left">文件或目录,对目前(有效的)用户或组来说是可写的</td>
</tr>

<tr>
<td class="left">-x</td>
<td class="left">文件或目录,对目前(有效的)用户或组来说是可执行的</td>
</tr>

<tr>
<td class="left">-o</td>
<td class="left">文件或目录,由目前(有效的)用户拥有</td>
</tr>

<tr>
<td class="left">-R</td>
<td class="left">文件或目录,对实际的用户或组来说是可读的</td>
</tr>

<tr>
<td class="left">-W</td>
<td class="left">文件或目录,对实际的用户或组来说是可写的</td>
</tr>

<tr>
<td class="left">-X</td>
<td class="left">文件或目录,对实际的用户或组来说是可执行的</td>
</tr>

<tr>
<td class="left">-O</td>
<td class="left">文件或目录,由实际的用户拥有</td>
</tr>

<tr>
<td class="left">-e</td>
<td class="left">文件或目录,是存在的</td>
</tr>

<tr>
<td class="left">-z</td>
<td class="left">文件存在而且没有内容(对目录来说永远为假</td>
</tr>

<tr>
<td class="left">-s</td>
<td class="left">文件或目录存在而且有内容(返回值是以字节为单位的文件大小)</td>
</tr>

<tr>
<td class="left">-f</td>
<td class="left">是普通文件</td>
</tr>

<tr>
<td class="left">-d</td>
<td class="left">是目录</td>
</tr>

<tr>
<td class="left">-l</td>
<td class="left">是符号链接</td>
</tr>

<tr>
<td class="left">-S</td>
<td class="left">是socket类型的文件</td>
</tr>

<tr>
<td class="left">-p</td>
<td class="left">是命名管道,也就是先入先出(fifo)队列</td>
</tr>

<tr>
<td class="left">-b</td>
<td class="left">是块设备文件(比如某个可挂臷的磁盘)</td>
</tr>

<tr>
<td class="left">-c</td>
<td class="left">是字符设备文件(比如某个I/O设备)</td>
</tr>

<tr>
<td class="left">-u</td>
<td class="left">文件或目录设置了setuid位</td>
</tr>

<tr>
<td class="left">-g</td>
<td class="left">文件或目录设置了setgid位</td>
</tr>

<tr>
<td class="left">-k</td>
<td class="left">文件或目录设置了sticky位</td>
</tr>

<tr>
<td class="left">-t</td>
<td class="left">文件句柄是TTY设备(类似系统函数isatty()的测试;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">不能对文件名进行此测试)</td>
</tr>

<tr>
<td class="left">-T</td>
<td class="left">看起来像文本文件</td>
</tr>

<tr>
<td class="left">-B</td>
<td class="left">看起来像二进制文件</td>
</tr>

<tr>
<td class="left">-M</td>
<td class="left">最后一次被修改后至今的天数</td>
</tr>

<tr>
<td class="left">-A</td>
<td class="left">最后一次被访问后至今的天数</td>
</tr>

<tr>
<td class="left">-C</td>
<td class="left">最后一次文件节点编号(inode)被变更后至今的天数</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-11-3" class="outline-3">
<h3 id="sec-11-3"><span class="section-number-3">11.3</span> <span class="todo TODO">TODO</span> 文件操作</h3>
<div class="outline-text-3" id="text-11-3">
<ul class="org-ul">
<li>rename 重命名<br  />
rename 'old', 'new';  同时 , 也可以用 =&gt; 即 rename 'old' =&gt; 'new';<br  />
</li>
<li>unlink 删除文件<br  />
unlink + 文件列表: unlink 'slate', 'lava'; 或 qw//  或  glob<br  />
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-11-4" class="outline-3">
<h3 id="sec-11-4"><span class="section-number-3">11.4</span> stat lstat 获得文件的属性</h3>
<div class="outline-text-3" id="text-11-4">
<p>
如果所传参数为符号链接,stat返回的是符号链接指向的对象的属性,<br  />
而非符号链接本身的属性.如果想得到符号链接的属性则使用lstat函数<br  />
Return a 13-elements list<br  />
($dev,$ino,$mode,$nlink,$uid,$gid,$rdev,$size,<br  />
$atime,$mtime,$ctime,$blksize,$blocks) = stat($filename);<br  />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">0 dev</td>
<td class="left">device number of filesystem</td>
</tr>

<tr>
<td class="left">1 ino</td>
<td class="left">inode number</td>
</tr>

<tr>
<td class="left">2 mode</td>
<td class="left">file mode  (type and permissions)</td>
</tr>

<tr>
<td class="left">3 nlink</td>
<td class="left">number of (hard) links to the file</td>
</tr>

<tr>
<td class="left">4 uid</td>
<td class="left">numeric user ID of file's owner</td>
</tr>

<tr>
<td class="left">5 gid</td>
<td class="left">numeric group ID of file's owner</td>
</tr>

<tr>
<td class="left">6 rdev</td>
<td class="left">the device identifier (special files only)</td>
</tr>

<tr>
<td class="left">7 size</td>
<td class="left">total size of file, in bytes</td>
</tr>

<tr>
<td class="left">8 atime</td>
<td class="left">last access time in seconds since the epoch</td>
</tr>

<tr>
<td class="left">9 mtime</td>
<td class="left">last modify time in seconds since the epoch</td>
</tr>

<tr>
<td class="left">10 ctime</td>
<td class="left">inode change time in seconds since the epoch (*)</td>
</tr>

<tr>
<td class="left">11 blksize</td>
<td class="left">preferred block size for file system I/O</td>
</tr>

<tr>
<td class="left">12 blocks</td>
<td class="left">actual number of blocks allocated</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-11-5" class="outline-3">
<h3 id="sec-11-5"><span class="section-number-3">11.5</span> <span class="todo TODO">TODO</span> 目录</h3>
<div class="outline-text-3" id="text-11-5">
<p>
chdir 相当于 cd 改变当前工作目录<br  />
chdir '/etc' or die "cannot chdir to /etc: $!";<br  />
</p>
</div>
</div>
<div id="outline-container-sec-11-6" class="outline-3">
<h3 id="sec-11-6"><span class="section-number-3">11.6</span> 文件句柄</h3>
<div class="outline-text-3" id="text-11-6">
<p>
&lt;STDIN&gt;    行输入 操作<br  />
$line = &lt;DATA&gt; 读取一行<br  />
@array = &lt;DATA&gt; 读入数组<br  />
</p>
<ul class="org-ul">
<li>_ 虚拟文件句柄 (用上次查询过的文件信息来做当前测试)<br  />
测试同一文件的多项属性<br  />
if(-r $file and -w _)<br  />
可以在不同的语句中使用<br  />
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> 一些函数</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-sec-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> 日期函数</h3>
<div class="outline-text-3" id="text-12-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">函数</th>
<th scope="col" class="left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">time</td>
<td class="left">返回1970年1月1日起经过无跳跃秒数</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">可以用gmtime和localtime做进一步处理</td>
</tr>

<tr>
<td class="left">times</td>
<td class="left">返回一个四个元素的列表,给出当前进程及其子进程用户和系统时间,</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">精确到秒</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">($uer, $system, $cuser, $csystem) = times</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">在标量上下文中,times 返回$user</td>
</tr>

<tr>
<td class="left">localtime EXPR</td>
<td class="left">把一个由time函数返回的时间转换成一个9个元素的列表,</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">同时把该时间按照本地时区转换</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">($sec,$min,$hour,$mday,$mon,$year,$wday,$yday,$isdst) =</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">localtime(time)</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">取得当前时间:$time = locatime; print $time;</td>
</tr>

<tr>
<td class="left">gmtime EXPR</td>
<td class="left">把一个由time 函数返回的时间转换成一个8个元素的列表,同时</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">把该时间转化成标准的格林威治时区时间</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> 简单</h3>
<div class="outline-text-3" id="text-12-2">
<p>
defined    判断是否为 undef 是返回假 否返回真<br  />
</p>
</div>
</div>
</div>
